{
    "mainData": [
        {
            "typeID": 1,
            "keyWords": [
                "Principled",
                "Purposeful",
                "Self-Controlled",
                "Perfectionistic"
            ],
            "briefDesc": "This person is conscientious and ethical, with a strong sense of right and wrong. They are teachers, crusaders, advocates for change, and always striving to improve things, but afraid of making a mistake. They are typically well-organized, orderly, and fastidious. They try to maintain high standards, but can slip into being critical and perfectionistic. They typically have problems with resentment and impatience.",
            "basicFear": "Of being corrupt/evil, defective",
            "basicDesire": "To be good, to have integrity, to be balanced",
            "wings": [
                    9,
                    2
            ],
            "levelOfDevelopment": [
                "This person is extraordinarily wise and discerning. By accepting what is, they have become transcendentally realistic, knowing the best action to take in each moment. Humane, inspiring, and hopeful knowing the truth will be heard.",
                "This person is conscientious with strong personal convictions. They have an intense sense of right and wrong, personal religious and moral values with a wish to be rational, reasonable, self-disciplined, mature, and moderate in all things.",
                "This person is extremely principled; they always want to be fair, objective, and ethical. Truth and justice are their primary values with a sense of responsibility and personal integrity. They feel like they have a higher purpose that often makes them teachers and witnesses to the truth.",
                "This person is dissatisfied with reality, which leads them becoming high-minded idealists and feeling that it is up to them to improve everything. These people are crusaders, advocates, and critics and are typically into 'causes' and explaining to others how things 'ought' to be.",
                "This person is afraid of making mistakes; Everything must be consistent with their ideals. They become orderly and well-organized, but impersonal, puritanical, emotionally constricted, rigidly keeping their feelings and impulses in check. They are often workaholics, 'anal-compulsive,' punctual, pedantic, and fastidious.",
                "This person is highly critical both of self and others: picky, judgmental, perfectionistic. Very opinionated about everything: correcting people and badgering them to 'do the right thing'—as they see it. Impatient, never satisfied with anything unless it is done according to their prescriptions. Moralizing, scolding, abrasive, and indignantly angry.",
                "They can be highly dogmatic, self-righteous, intolerant, and inflexible. They begin to deal in absolutes, believing that they alone know 'The Truth.' Everyone else is wrong in their eyes and they are very severe in their judgments, while rationalizing their own actions.",
                "They become obsessive about imperfection and the wrongdoing of others, although they may fall into contradictory actions, hypocritically doing the opposite of what they preach.",
                "They become condemnatory toward others, punitive and cruel to rid themselves of wrongdoers. Severe depressions, nervous breakdowns, and suicide attempts are likely. Generally corresponds to the Obsessive-Compulsive and Depressive personality disorders."
            ],
            "keyMotivations": "Want to be right, to strive higher and improve everything, to be consistent with their ideals, to justify themselves, to be beyond criticism so as not to be condemned by anyone.",
            "overview": "Content TBD",
            "addictions": "Excessive use of diets, vitamins, and cleansing techniques (fasts, diet pills, enemas). Under-eating for self-control: in extreme cases anorexia and bulimia. Alcohol to relieve tension.",
            "growthRecommendations": [
                "Learn to relax. Take some time for yourself, without feeling that everything is up to you or that what you do not accomplish will result in chaos and disaster. Mercifully, the salvation of the world does not depend on you alone, even though you may sometimes feel it does.",
                "You have a lot to teach others and are probably a good teacher, but do not expect others to change immediately. What is obvious to you may not be as obvious to them, especially if they are not used to being as self-disciplined and objective about themselves as you are about yourself. Many people may also want to do what is right and may agree with you in principle but for various reasons simply cannot change right away. The fact that others do not change immediately according to your prescriptions does not mean that they will not change sometime in the future. Your words and above all, your example may do more good than you realize, although they may take longer than you expect. So have patience.",
                "It is easy for you to work yourself up into a lather about the wrongdoings of others. And it may sometimes be true that they are wrong. But what is it to you? Your irritation with them will do nothing to help them see another way of being. Similarly, beware of your constant irritation with your own \"shortcomings.\" Does your own harsh self-criticism really help you to improve? Or does it simply make you tense, nervous, and self-doubting? Learn to recognize the attacks of your superego and how they undermine rather than help you.",
                "It is important for you to get in touch with your feelings, particularly your unconscious impulses. You may find that you are uneasy with your emotions and your sexual and aggressive impulses—in short, with the messy human things that make us human. It might be beneficial to keep a journal or to get into some kind of group therapy or other group work both to develop your emotions and to see that others will not condemn you for having human needs and limitations.",
                "Your Achilles' heel is your self-righteous anger. You get angry easily and are offended by what seems to you to be the perverse refusal of others to do the right thing—as you have defined it. Try to step back and see that your anger alienates people so that they cannot hear many of the good things you have to say. Further, your own repressed anger may well be giving you an ulcer or high blood pressure and is a harbinger of worse things to come."
            ]
        },
        {
            "typeID": 2,
            "keyWords": [
                "TheCaring",
                "InterpersonalType:"
            ],
            "briefDesc": "This person is empathetic, sincere, and warm-hearted. They are friendly, generous, and self-sacrificing, but can also be sentimental, flattering, and people-pleasing. They are well-meaning and driven to be close to others, but can slip into doing things for others in order to be needed. They typically have problems with possessiveness and with acknowledging their own needs.",
            "basicFear": "Of being unwanted, unworthy of being loved",
            "basicDesire": "To feel loved",
            "wings": [
                    1,
                    3
            ],
            "levelOfDevelopment": [
                "This person becomes deeply unselfish, humble, and altruistic, giving unconditional love to self and others. They feel that it is a privilege to be in the lives of others.",
                "This person is empathetic, compassionate, and feeling for others. They are caring and concerned about their needs as well as thoughtful, warm-hearted, forgiving and sincere.",
                "This person is encouraging and appreciative, and able to see the good in others. To them service is important, but taking care of self is just as important too. They are nurturing, generous, and giving—a truly loving person.",
                "This person wants to be closer to others, so they start 'people pleasing' and becoming overly friendly, emotionally demonstrative, and full of 'good intentions' about everything. They give seductive attention: approval, 'strokes', and flattery are common examples. Love is their supreme value, and they talk about it constantly.",
                "This person becomes overly intimate and intrusive; They need to be needed, so they hover, meddle, and control in the name of love. They want others to depend on them, so they give, but expect a return and often send double messages. They are typically enveloping and possessive: they are the codependent, self-sacrificial person who cannot do enough for others without wearing themselves out for everyone, and creating needs for themselves to fulfill.",
                "This person is increasingly self-important and self-satisfied, and feel they are indispensable, although they overrate their efforts on others' behalf. Prone to hypochondria and becoming a 'martyr' for others. They are overbearing, patronizing, and presumptuous.",
                "This person can be manipulative and self-serving, and often instills guilt by telling others how much they owe them and make them suffer. They can abuse food and medication to 'stuff feelings' and get sympathy. Often times this person will undermine people and make belittling or disparaging remarks. They can be extremely self-deceptive about their motives and how aggressive and/or selfish their behavior is.",
                "This person can be domineering and coercive, and feel entitled to get anything they want from others. Typically this comes in the form of the repayment of old debts, money, sexual favors.",
                "This person is able to excuse and rationalize what they do since they feel abused and victimized by others and are bitterly resentful and angry. Often times somatization of their aggressions results in chronic health problems as they vindicate themselves by 'falling apart' and burdening others. Generally corresponds to the Histrionic Personality Disorder and Factitious Disorder."
            ],
            "keyMotivations": "Want to be loved, to express their feelings for others, to be needed and appreciated, to get others to respond to them, to vindicate their claims about themselves.",
            "overview": "Content TBD",
            "addictions": "Abusing food and over-the-counter medications. Bingeing, especially on sweets and carbohydrates. Over-eating from feeling clove-starved; in extreme cases bulimia. Hypochondria to look for sympathy.",
            "growthRecommendations": [
                "First and foremost, remember that if you are not addressing your own needs, it is highly unlikely that you will be able to meet anyone else's needs without problems, underlying resentments, and continual frustration. Further, you will be less able to respond to people in a balanced way if you have not gotten adequate rest, and taken care of yourself properly. It is not selfish to make sure that you are okay before attending to others' needs—it is simply common sense.",
                "Try to become more conscious of your own motives when you decide to help someone. While doing good things for people is certainly an admirable trait, when you do so because you expect the other person to appreciate you or do something nice for you in return, you are setting yourself up for disappointments. Your type has a real danger of falling into unconscious codependent patterns with loved ones, and they almost never bring you what you really want.",
                "While there are many things you might want to do for people, it is often better to ask them what they really need first. You are gifted at accurately intuiting others' feelings and needs, but that does not necessarily mean that they want those needs remedied by you in the way you have in mind. Communicate your intentions, and be willing to accept a \"no thank you.\" Someone deciding that they do not want your particular offer of help does not mean that they dislike you or are rejecting you.",
                "Resist the temptation to call attention to yourself and your good works. After you have done something for others, do not remind them about it. Let it be: either they will remember your kindness themselves and thank you in their own way or they will not. Your calling attention to what you have done for them only puts people on the spot and makes them feel uneasy. It will not satisfy anyone or improve your relationships.",
                "Learn to recognize the affection and good wishes of others, even when these are not in terms that you are familiar with. Although others may not express their feelings in a way that you want, they may be letting you know in other ways how much they care about you. If you can recognize what others are giving you, you will rest more easily in the knowledge that you really are loved. Love is always available but only to the degree that we are present and therefore receptive to it."
            ]
        },
        {
            "typeID": 3,
            "keyWords": [
                "TheSuccess-Oriented",
                "PragmaticType:"
            ],
            "briefDesc": "This person is self-assured, attractive, and charming. They are often ambitious, competent, and energetic, and they can also be status-conscious and highly driven for advancement. They are diplomatic and poised, but can also be overly concerned with their image and what others think of them. They typically have problems with workaholism and competitiveness.",
            "basicFear": "Of being worthless",
            "basicDesire": "To feel valuable and worthwhile",
            "wings": [
                    2,
                    4
            ],
            "levelOfDevelopment": [
                "Self-accepting, inner-directed, and authentic, everything they seem to be. Modest and charitable, self-deprecatory humor and a fullness of heart emerge. Gentle and benevolent.",
                "Self-assured, energetic, and competent with high self-esteem: they believe in themselves and their own value. Adaptable, desirable, charming, and gracious.",
                "Ambitious to improve themselves, to be 'the best they can be'—often become outstanding, a human ideal, embodying widely admired cultural qualities. Highly effective: others are motivated to be like them in some positive way.",
                "Highly concerned with their performance, doing their job well, constantly driving self to achieve goals as if self-worth depends on it. Terrified of failure. Compare self with others in search for status and success. Become careerists, social climbers, invested in exclusivity and being the 'best.'",
                "Become image-conscious, highly concerned with how they are perceived. Begin to package themselves according to the expectations of others and what they need to do to be successful. Pragmatic and efficient, but also premeditated, losing touch with their own feelings beneath a smooth facade. Problems with intimacy, credibility, and 'phonines' emerge.",
                "Want to impress others with their superiority: constantly promoting themselves, making themselves sound better than they really are. Narcissistic, with grandiose, inflated notions about themselves and their talents. Exhibitionistic and seductive, as if saying 'Look at me!' Arrogance and contempt for others is a defense against feeling jealous of others and their success.",
                "Fearing failure and humiliation, they can be exploitative and opportunistic, covetous of the success of others, and willing to do 'whatever it takes' to preserve the illusion of their superiority.",
                "Devious and deceptive so that their mistakes and wrongdoings will not be exposed. Untrustworthy, maliciously betraying or sabotaging people to triumph over them. Delusionally jealous of others",
                "Become vindictive, attempting to ruin others' happiness. Relentless, obsessive about destroying whatever reminds them of their own shortcomings and failures. Psychopathic behavior. Generally corresponds to the Narcissistic Personality Disorder."
            ],
            "keyMotivations": "Want to be affirmed, to distinguish themselves from others, to have attention, to be admired, and to impress others.",
            "overview": "Content TBD",
            "addictions": "Over-stressing the body for recognition. Working out to exhaustion. Starvation diets. Workaholism. Excessive intake of coffee, stimulants, amphetamines, cocaine, steroids or excessive surgery for cosmetic improvement.",
            "growthRecommendations": [
                "For our real development, it is essential to be truthful. Be honest with yourself and others about your genuine feelings and needs. Likewise, resist the temptation to impress others or inflate your importance. You will impress people more deeply by being authentic than by bragging about your successes or exaggerating your accomplishments.",
                "Develop charity and cooperation in your relationships. You can do this by taking time to pause in a busy day to really connect with someone you care about. Nothing spectacular is required—simply a few moments of quiet appreciation. When you do so, you will become a more loving person, a more faithful friend—and a much more desirable individual. You will feel better about yourself.",
                "Take breaks. You can drive yourself and others to exhaustion with your relentless pursuit of your goals. Ambition and self-development are good qualities, but temper them with rest periods in which you reconnect more deeply with yourself. Sometimes taking three to five deep breaths is enough to recharge your battery and improve your outlook.",
                "Develop your social awareness. Many Threes have grown tremendously by getting involved in projects that had nothing to do with their own personal advancement. Working cooperatively with others toward goals that transcend personal interest is a powerful way of finding your true value and identity.",
                "In their desire to be accepted by others, some average Threes adapt so much to the expectations of others that they lose touch with what they are really feeling about the situation. Develop yourself by resisting doing what is acceptable just to be accepted. It is imperative that you invest time in discovering your own core values."
            ]
        },
        {
            "typeID": 4,
            "keyWords": [
                "TheSensitive",
                "IntrospectiveType:"
            ],
            "briefDesc": "This person is self-aware, sensitive, and reserved. They are emotionally honest, creative, and personal, but can also be moody and self-conscious. They can be prone to withholding themselves from others due to feeling vulnerable and defective. They can also feel disdainful and exempt from ordinary ways of living and they typically have problems with melancholy, self-indulgence, and self-pity.",
            "basicFear": "That they have no identity or personal significance",
            "basicDesire": "To find themselves and their significance (to create an",
            "wings": [
                    3,
                    5
            ],
            "levelOfDevelopment": [
                "Profoundly creative, expressing the personal and the universal, possibly in a work of art. Inspired, self-renewing and regenerating: able to transform all their experiences into something valuable: self-creative.",
                "Self-aware, introspective, on the 'search for self,' aware of feelings and inner impulses. Sensitive and intuitive both to self and others: gentle, tactful, compassionate.",
                "Highly personal, individualistic, 'true to self.' Self-revealing, emotionally honest, humane. Ironic view of self and life: can be serious and funny, vulnerable and emotionally strong.",
                "Take an artistic, romantic orientation to life, creating a beautiful, aesthetic environment to cultivate and prolong personal feelings. Heighten reality through fantasy, passionate feelings, and the imagination.",
                "To stay in touch with feelings, they interiorize everything, taking everything personally, but become self-absorbed and introverted, moody and hypersensitive, shy and self-conscious, unable to be spontaneous or to 'get out of themselves.' Stay withdrawn to protect their self-image and to buy time to sort out feelings.",
                "Gradually think that they are different from others, and feel that they are exempt from living as everyone else does. They become melancholy dreamers, disdainful, decadent, and sensual, living in a fantasy world. Self-pity and envy of others leads to self-indulgence, and to becoming increasingly impractical, unproductive, effete, and precious.",
                "When dreams fail, become self-inhibiting and angry at self, depressed and alienated from self and others, blocked and emotionally paralyzed. Ashamed of self, fatigued and unable to function.",
                "Tormented by delusional self-contempt, self-reproaches, self-hatred, and morbid thoughts: everything is a source of torment. Blaming others, they drive away anyone who tries to help them.",
                "Despairing, feel hopeless and become self-destructive, possibly abusing alcohol or drugs to escape. In the extreme: emotional breakdown or suicide is likely. Generally corresponds to the Avoidant, Depressive, and Narcissistic personality disorders."
            ],
            "keyMotivations": "Want to express themselves and their individuality, to create and surround themselves with beauty, to maintain certain moods and feelings, to withdraw to protect their self-image, to take care of emotional needs before attending to anything else, to attract a 'rescuer.'",
            "overview": "Content TBD",
            "addictions": "Over-indulgence in rich foods, sweets, alcohol to alter mood, to socialize, and for emotional consolation. Lack of physical activity. Bulimia. Depression. Tobacco, prescription drugs, or heroin for social anxiety. Cosmetic surgery to erase rejected features.",
            "growthRecommendations": [
                "Do not pay so much attention to your feelings; they are not a true source of support for you, as you probably already know. Remember this advice: \"From our present perspective, we can also see that one of the most important mistakes Fours make is to equate themselves with their feelings. The fallacy is that to understand themselves they must understand their feelings, particularly their negative ones, before acting. Fours do not see that the self is not the same as its feelings or that the presence of negative feelings does not preclude the presence of good in themselves\" (Personality Types, p. 172). Always remember that your feelings are telling you something about yourself as you are at this particular moment, not necessarily more than that.",
                "Avoid putting off things until you are \"in the right mood.\" Commit yourself to productive, meaningful work that will contribute to your good and that of others, no matter how small the contribution may be. Working consistently in the real world will create a context in which you can discover yourself and your talents. (Actually, you are happiest when you are working—that is, activating your potentials and realizing yourself. You will not \"find yourself\" in a vacuum or while waiting for inspiration to strike, so connect—and stay connected—with the real world.",
                "Self-esteem and self-confidence will develop only from having positive experiences, whether or not you believe that you are ready to have them. Therefore, put yourself in the way of good. You may never feel that you are ready to take on a challenge of some sort, that you always need more time. (Fours typically never feel that they are sufficiently \"together,\" but they must nevertheless have the courage to stop putting off their lives.) Even if you start small, commit yourself to doing something that will bring out the best in you.",
                "A wholesome self-discipline takes many forms, from sleeping regular hours to working regularly to exercising regularly, and has a cumulative, strengthening effect. Since it comes from yourself, a healthy self-discipline is not contrary to your freedom or individuality. On the other hand, sensuality, excessive sexual experiences, alcohol, drugs, sleep, or fantasizing have a debilitating effect on you, as you already know. Therefore, practice healthy self-discipline and stay with it.",
                "Avoid lengthy conversations in your imagination, particularly if they are negative, resentful, or even excessively romantic. These conversations are essentially unreal and at best only rehearsals for action—although, as you know, you almost never say or do what you imagine you will. Instead of spending time imagining your life and relationships, begin to live them."
            ]
        },
        {
            "typeID": 5,
            "keyWords": [
                "TheIntense",
                "CerebralType:"
            ],
            "briefDesc": "This person is alert, insightful, and curious. They are able to concentrate and focus on developing complex ideas and skills. This person is typically independent, innovative, and inventive, yet they can also become preoccupied with their thoughts and imaginary constructs. They can become detached, yet high-strung and intense. They typically have problems with eccentricity, nihilism, and isolation.",
            "basicFear": "Being useless, helpless, or incapable",
            "basicDesire": "To be capable and competent",
            "wings": [
                    4,
                    6
            ],
            "levelOfDevelopment": [
                "Become visionaries, broadly comprehending the world while penetrating it profoundly. Open-minded, take things in whole, in their true context. Make pioneering discoveries and find entirely new ways of doing and perceiving things.",
                "Observe everything with extraordinary perceptiveness and insight. Most mentally alert, curious, searching intelligence: nothing escapes their notice. Foresight and prediction. Able to concentrate: become engrossed in what has caught their attention.",
                "Attain skillful mastery of whatever interests them. Excited by knowledge: often become expert in some field. Innovative and inventive, producing extremely valuable, original works. Highly independent, idiosyncratic, and whimsical.",
                "Begin conceptualizing and fine-tuning everything before acting—working things out in their minds: model building, preparing, practicing, and gathering more resources. Studious, acquiring technique. Become specialized, and often 'intellectual,' often challenging accepted ways of doing things.",
                "Increasingly detached as they become involved with complicated ideas or imaginary worlds. Become preoccupied with their visions and interpretations rather than reality. Are fascinated by off-beat, esoteric subjects, even those involving dark and disturbing elements. Detached from the practical world, a 'disembodied mind,' although high-strung and intense.",
                "Begin to take an antagonistic stance toward anything which would interfere with their inner world and personal vision. Become provocative and abrasive, with intentionally extreme and radical views. Cynical and argumentative.",
                "Become reclusive and isolated from reality, eccentric and nihilistic. Highly unstable and fearful of aggressions: they reject and repulse others and all social attachments.",
                "Get obsessed yet frightened by their threatening ideas, becoming horrified, delirious, and prey to gross distortions and phobias.",
                "Seeking oblivion, they may commit suicide or have a psychotic break with reality. Deranged, explosively self-destructive, with schizophrenic overtones. Generally corresponds to the Schizoid Avoidant and Schizotypal personality disorders."
            ],
            "keyMotivations": "Want to possess knowledge, to understand the environment, to have everything figured out as a way of defending the self from threats from the environment.",
            "overview": "Content TBD",
            "addictions": "Poor eating and sleeping habits due to minimizing needs. Neglecting hygiene and nutrition. Lack of physical activity. Psychotropic drugs for mental stimulation and escape, narcotics for anxiety.",
            "growthRecommendations": [
                "Learn to notice when your thinking and speculating takes you out of the immediacy of your experience. Your mental capacities can be an extraordinary gift, but only can also be a trap when you use them to retreat from contact with yourself and others. Stay connected with your physicality.",
                "You tend to be extremely intense and so high-strung that you find it difficult to relax and unwind. Make an effort to learn to calm down in a healthy way, without drugs or alcohol. Exercising or using biofeedback techniques will help channel some of your tremendous nervous energy. Meditation, jogging, yoga, and dancing are especially helpful for your type.",
                "You see many possibilities but often do not know how to choose among them or judge which is more or less important. When you are caught in your fixation, a sense of perspective can be missing, and with it the ability to make accurate assessments. At such time, it can be helpful to get the advice of someone whose judgment you trust while you are gaining perspective on your situation. Doing this can also help you trust someone else, a difficulty for your type.",
                "Notice when you are getting intensely involved in projects that do not necessarily support your self-esteem, confidence, or life situation. It is possible to follow many different fascinating subjects, games, and pastimes, but they can become huge distractions from what you know you really need to do. Decisive action will bring more confidence than learning more facts or acquiring more unrelated skills.",
                "Fives tend to find it difficult to trust people, to open up to them emotionally, or to make themselves accessible in various ways. Their awareness of potential problems in relationships may tend to create a self-fulfilling prophecy. It is important to remember that having conflicts with others is not unusual and that the healthy thing is to work them out rather than reject attachments with people by withdrawing into isolation. Having one or two intimate friends whom you trust enough to have conflicts with will enrich your life greatly."
            ]
        },
        {
            "typeID": 6,
            "keyWords": [
                "TheCommitted",
                "Security-OrientedType:"
            ],
            "briefDesc": "This person is the committed, security-oriented type. They are reliable, hard-working, responsible, and trustworthy. They are typically excellent 'troubleshooters', since they car foresee problems and foster cooperation. They can also become defensive, evasive, and anxious running on stress while complaining about it. They can be cautious and indecisive, but also reactive, defiant and rebellious. They typically have problems with self-doubt and suspicion.",
            "basicFear": "Of being without support and guidance",
            "basicDesire": "To have security and support",
            "wings": [
                    5,
                    7
            ],
            "levelOfDevelopment": [
                "Become self-affirming, trusting of self and others, independent yet symbiotically interdependent and cooperative as an equal. Belief in self leads to true courage, positive thinking, leadership, and rich self-expression.",
                "Able to elicit strong emotional responses from others: very appealing, endearing, lovable, affectionate. Trust important: bonding with others, forming permanent relationships and alliances.",
                "Dedicated to individuals and movements in which they deeply believe. Community builders: responsible, reliable, trustworthy. Hard-working and persevering, sacrificing for others, they create stability and security in their world, bringing a cooperative spirit.",
                "Start investing their time and energy into whatever they believe will be safe and stable. Organizing and structuring, they look to alliances and authorities for security and continuity. Constantly vigilant, anticipating problems.",
                "To resist having more demands made on them, they react against others passive-aggressively. Become evasive, indecisive, cautious, procrastinating, and ambivalent. Are highly reactive, anxious, and negative, giving contradictory, 'mixed signals.' Internal confusion makes them react unpredictably.",
                "To compensate for insecurities, they become sarcastic and belligerent, blaming others for their problems, taking a tough stance toward 'outsiders.' Highly reactive and defensive, dividing people into friends and enemies, while looking for threats to their own security. Authoritarian while fearful of authority, highly suspicious, yet, conspiratorial, and fear-instilling to silence their own fears.",
                "Fearing that they have ruined their security, they become panicky, volatile, and self-disparaging with acute inferiority feelings. Seeing themselves as defenseless, they seek out a stronger authority or belief to resolve all problems. Highly divisive, disparaging and berating others",
                "Feeling persecuted, that others are 'out to get them,' they lash-out and act irrationally, bringing about what they fear. Fanaticism, violence.",
                "Hysterical, and seeking to escape punishment, they become self-destructive and suicidal. Alcoholism, drug overdoses, self-abasing behavior. Generally corresponds to the Passive-Aggressive and Paranoid personality disorders."
            ],
            "keyMotivations": "Want to have security, to feel supported by others, to have certitude and reassurance, to test the attitudes of others toward them, to fight against anxiety and insecurity.",
            "overview": "Content TBD",
            "addictions": "Rigidity in diet causes nutritional imbalances (\"I don't like vegetables\"). Working excessively. Caffeine and amphetamines for stamina, but also alcohol and depressants to deaden anxiety. Higher susceptibility to alcoholism than many types.",
            "growthRecommendations": [
                "Remember that there is nothing unusual about being anxious since everyone is anxious and much more often than you might think. Learn to be more present to your anxiety, to explore it, and to come to terms with it. Work creatively with your tensions without turning to excessive amounts of alcohol (or other drugs) to allay them. In fact, if you are present and breathing fully, anxiety can be energizing, a kind of tonic that can help make you more productive and aware of what you are doing.",
                "You tend to get edgy and testy when you are upset or angry, and can even turn on others and blame them for things you have done or brought on yourself. Be aware of your pessimism: it causes you dark moods and negative thought patterns that you tend to project on reality. When you succumb to this self-doubt, you can become your own worst enemy and may harm yourself more than anyone else does.",
                "Sixes tend to overreact when they are under stress and feeling anxious. Learn to identify what makes you overreact. Also realize that almost none of the things you have feared so much has actually come true. Even if things are as bad as you think, your fearful thoughts weaken you and your ability to change things for the better. You cannot always manage external events, but you can manage your own thoughts.",
                "Work on becoming more trusting. There are doubtless several people in your life you can turn to who care about you and who are trustworthy. If not, go out of your way to find someone trustworthy, and allow yourself to get close to that person. This will mean risking rejection and stirring up some of your deepest fears, but the risk is worth taking. You have a gift for getting people to like you, but you are unsure of yourself and may be afraid of making a commitment to them. Therefore, come down clearly on one side or the other of the fence in your relationships. Let people know how you feel about them.",
                "Others probably think better of you than you realize, and few people are really out to get you. In fact, your fears tell you more about your attitudes toward others than they indicate about others' attitudes toward you."
            ]
        },
        {
            "typeID": 7,
            "keyWords": [
                "TheBusy",
                "Variety-SeekingType:"
            ],
            "briefDesc": "This person is extroverted, optimistic, versatile, and spontaneous. They can be playful, high-spirited, and practical, but they can also misapply their many talents and become over-extended, scattered, and undisciplined. They constantly seek new and exciting experiences, but can become distracted and exhausted by staying on the go. They typically have problems with impatience and impulsiveness.",
            "basicFear": "Of being deprived and in pain",
            "basicDesire": "To be satisfied, content, and to have their needs fulfilled",
            "wings": [
                    6,
                    8
            ],
            "levelOfDevelopment": [
                "Assimilate experiences in depth, making them deeply grateful and appreciative for what they have. Become awed by the simple wonders of life: joyous and ecstatic. Intimations of spiritual reality, of the boundless goodness of life.",
                "Highly responsive, excitable, enthusiastic about sensation and experience. Most extroverted type: stimuli bring immediate responses—they find everything invigorating. Lively, vivacious, eager, spontaneous, resilient, cheerful.",
                "Easily become accomplished achievers, generalists who do many different things well: multi-talented. Practical, productive, usually prolific, cross-fertilizing areas of interest.",
                "As restlessness increases, want to have more options and choices available to them. Become adventurous and 'worldly wise,' but less focused, constantly seeking new things and experiences: the sophisticate, connoisseur, and consumer. Money, variety, keeping up with the latest trends important.",
                "Unable to discriminate what they really need, become hyperactive, unable to say 'no' to themselves, throwing self into constant activity. Uninhibited, doing and saying whatever comes to mind: storytelling, flamboyant exaggerations, witty wise-cracking, performing. Fear being bored: in perpetual motion, but do too many things—many ideas but little follow through.",
                "Get into conspicuous consumption and all forms of excess. Self-centered, materialistic, and greedy, never feeling that they have enough. Demanding and pushy, yet unsatisfied and jaded. Addictive, hardened, and insensitive.",
                "Desperate to quell their anxieties, can be impulsive and infantile: do not know when to stop. Addictions and excess take their toll: debauched, depraved, dissipated escapists, offensive and abusive.",
                "In flight from self, acting out impulses rather than dealing with anxiety or frustrations: go out of control, into erratic mood swings, and compulsive actions (manias).",
                "Finally, their energy and health is completely spent: become claustrophobic and panic-stricken. Often give up on themselves and life: deep depression and despair, self-destructive overdoses, impulsive suicide. Generally corresponds to the Bipolar disorder and Histrionic personality disorder."
            ],
            "keyMotivations": "Want to maintain their freedom and happiness, to avoid missing out on worthwhile experiences, to keep themselves excited and occupied, to avoid and discharge pain.",
            "overview": "Content TBD",
            "addictions": "The type most prone to addictions: stimulants (caffeine, cocaine, and amphetamines), Ecstasy, psychotropics, narcotics, and alcohol but tend to avoid other depressants. Wear body out with effort to stay \"up.\" Excessive cosmetic surgery, pain killers.",
            "growthRecommendations": [
                "Recognize your impulsiveness, and get in the habit of observing your impulses rather than giving in to them. This means letting most of your impulses pass and becoming a better judge of which ones are worth acting on. The more you can resist acting out your impulses, the more you will be able to focus on what is really good for you.",
                "Learn to listen to other people. They are often interesting, and you may learn things that will open new doors for you. Also learn to appreciate silence and solitude: you do not have to distract yourself (and protect yourself from anxiety) with constant noise from the television or the stereo. By learning to live with less external stimulation, you will learn to trust yourself. You will be happier than you expect because you will be satisfied with whatever you do, even if it is less than you have been doing.",
                "You do not have to have everything this very moment. That tempting new acquisition will most likely still be available tomorrow (this is certainly true of food, alcohol, and other common gratifications—that ice cream cone, for instance). Most good opportunities will come back again—and you will be in a better position to discern which opportunities really are best for you.",
                "Always choose quality over quantity, especially in your experiences. The ability to have experiences of quality can be learned only by giving your full attention to the experience you are having now. If you keep anticipating future experiences, you will keep missing the present one and undermine the possibility of ever being satisfied.",
                "Make sure that what you want will really be good for you in the long run. As the saying goes, watch what you pray for since your prayers may be answered. In the same vein, think about the long-term consequences of what you want since you may get it only to find that it becomes another disappointment—or even a source of unhappiness."
            ]
        },
        {
            "typeID": 8,
            "keyWords": [
                "ThePowerful",
                "DominatingType:"
            ],
            "briefDesc": "This person is self-confident, strong, and assertive. They are often protective, resourceful, straight-talking, and decisive, but can also be ego-centric and domineering. They feel they must control their environment, especially people, sometimes becoming confrontational and intimidating. They typically have problems with their tempers and with allowing themselves to be vulnerable.",
            "basicFear": "Of being harmed or controlled by others",
            "basicDesire": "To protect themselves and to be in control of their own life",
            "wings": [
                    7,
                    9
            ],
            "levelOfDevelopment": [
                "Become self-restrained and magnanimous, merciful and forbearing, mastering self through their self-surrender to a higher authority. Courageous, willing to put self in serious jeopardy to achieve their vision and have a lasting influence. May achieve true heroism and historical greatness.",
                "Self-assertive, self-confident, and strong: have learned to stand up for what they need and want. A resourceful, 'can do' attitude and passionate inner drive.",
                "Decisive, authoritative, and commanding: the natural leader others look up to. Take initiative, make things happen: champion people, provider, protective, and honorable, carrying others with their strength.",
                "Self-sufficiency, financial independence, and having enough resources are important concerns: become enterprising, pragmatic, 'rugged individualists,' wheeler-dealers. Risk-taking, hardworking, denying own emotional needs.",
                "Begin to dominate their environment, including others: want to feel that others are behind them, supporting their efforts. Swaggering, boastful, forceful, and expansive: the 'boss' whose word is law. Proud, egocentric, want to impose their will and vision on everything, not seeing others as equals or treating them with respect.",
                "Become highly combative and intimidating to get their way: confrontational, belligerent, creating adversarial relationships. Everything a test of wills, and they will not back down. Use threats and reprisals to get obedience from others, to keep others off balance and insecure. However, unjust treatment makes others fear and resent them, possibly also band together against them.",
                "Defying any attempt to control them, become completely ruthless, dictatorial, 'might makes right.' The criminal and outlaw, renegade, and con-artist. Hard-hearted, immoral and potentially violent.",
                "Develop delusional ideas about their power, invincibility, and ability to prevail: megalomania, feeling omnipotent, invulnerable. Recklessly over-extending self.",
                "If they get in danger, they may brutally destroy everything that has not conformed to their will rather than surrender to anyone else. Vengeful, barbaric, murderous. Sociopathic tendencies. Generally corresponds to the Antisocial Personality Disorder."
            ],
            "keyMotivations": "Want to be self-reliant, to prove their strength and resist weakness, to be important in their world, to dominate the environment, and to stay in control of their situation.",
            "overview": "Content TBD",
            "addictions": "Ignore physical needs and problems: avoid medical visits and check-ups. Indulging in rich foods, alcohol, tobacco while pushing self too hard leads to high stress, strokes, and heart conditions. Control issues central, although alcoholism and narcotic addictions are possible.",
            "growthRecommendations": [
                "It goes against the grain, but act with self-restraint. You show true power when you forbear from asserting your will with others, even when you could. Your real power lies in your ability to inspire and uplift people. You are at your best when you take charge and help everyone through a crisis. Few will take advantage of you when you are caring, and you will do more to secure the loyalty and devotion of others by showing the greatness of your heart than you ever could by displays of raw power.",
                "It is difficult for Eights, but learn to yield to others, at least occasionally. Often, little is really at stake, and you can allow others to have their way without fear of sacrificing your power, or your real needs. The desire to dominate everyone all the time is a sign that your ego is beginning to inflate—a danger signal that more serious conflicts with others are inevitable.",
                "Remember that the world is not against you. Many people in your life care about you and look up to you, but when you are in your fixation, you do not make this easy for them. Let in the affection that is available. Doing this will not make you weak, but will confirm the strength and support in yourself and your life. Also remember that by believing that others are against you and reacting against them, you tend to alienate them and confirm your own fears. Take stock of the people who truly are on your side, and let them know how important they are to you.",
                "Eights typically want to be self-reliant and depend on no one. But, ironically, they depend on many people. For example, you may think that you are not dependent on your employees because they depend on you for their jobs. You could dismiss them at any time and hire other workers. Everyone is expendable in your little kingdom—except you. But the fact is that you are dependent on others to do their jobs too, especially if your business concerns grow beyond what you can manage alone. But if you alienate everyone associated with you, you will eventually be forced to employ the most obsequious and untrustworthy operatives. When you do, you will have reason to question their loyalty and to fear losing your position. The fact is that whether in your business world or your domestic life, your self-sufficiency is largely an illusion.",
                "Eights typically overvalue power. Having power, whether through wealth, position, or simple brute force, allows them to do whatever they want, to feel important, to be feared and obeyed. But those who are attracted to you because of your power do not love you for yourself, nor do you love or respect them. While this may be the Faustian bargain you have made, you will nevertheless have to pay the price that whatever power you accumulated will inevitably be at a cost to you, physically and emotionally."
            ]
        },
        {
            "typeID": 9,
            "keyWords": [
                "TheEasygoing",
                "Self-EffacingType:"
            ],
            "briefDesc": "This person is accepting, trusting, and stable. They are usually creative, optimistic, and supportive, but can also be too willing to go along with others to keep the peace. They want everything to go smoothly and be without conflict, but they can also tend to be complacent, simplifying problems and minimizing anything upsetting. They typically have problems with inertia and stubbornness.",
            "basicFear": "Of loss and separation",
            "basicDesire": "To have inner stability 'peace of mind'",
            "wings": [
                    8,
                    1
            ],
            "levelOfDevelopment": [
                "Become self-possessed, feeling autonomous and fulfilled: have great equanimity and contentment because they are present to themselves. Paradoxically, at one with self, and thus able to form more profound relationships. Intensely alive, fully connected to self and others.",
                "Deeply receptive, accepting, unselfconscious, emotionally stable and serene. Trusting of self and others, at ease with self and life, innocent and simple. Patient, unpretentious, good-natured, genuinely nice people.",
                "Optimistic, reassuring, supportive: have a healing and calming influence—harmonizing groups, bringing people together: a good mediator, synthesizer, and communicator.",
                "Fear conflicts, so become self-effacing and accommodating, idealizing others and 'going along' with their wishes, saying 'yes' to things they do not really want to do. Fall into conventional roles and expectations. Use philosophies and stock sayings to deflect others.",
                "Active, but disengaged, unreflective, and inattentive. Do not want to be affected, so become unresponsive and complacent, walking away from problems, and 'sweeping them under the rug.' Thinking becomes hazy and ruminative, mostly comforting fantasies, as they begin to 'tune out' reality, becoming oblivious. Emotionally indolent, unwillingness to exert self or to focus on problems: indifference.",
                "Begin to minimize problems, to appease others and to have 'peace at any price.' Stubborn, fatalistic, and resigned, as if nothing could be done to change anything. Into wishful thinking, and magical solutions. Others frustrated and angry by their procrastination and unresponsiveness.",
                "Can be highly repressed, undeveloped, and ineffectual. Feel incapable of facing problems: become obstinate, dissociating self from all conflicts. Neglectful and dangerous to others.",
                "Wanting to block out of awareness anything that could affect them, they dissociate so much that they eventually cannot function: numb, depersonalized.",
                "They finally become severely disoriented and catatonic, abandoning themselves, turning into shattered shells. Multiple personalities possible. Generally corresponds to the Schizoid and Dependent personality disorders."
            ],
            "keyMotivations": "Want to create harmony in their environment, to avoid conflicts and tension, to preserve things as they are, to resist whatever would upset or disturb them.",
            "overview": "Content TBD",
            "addictions": "Over-eating or under-eating due to lack of self-awareness and repressed anger. Lack of physical activity. Depressants and psychotropics, alcohol, marijuana, narcotics to deaden loneliness and anxiety.",
            "growthRecommendations": [
                "It is worth examining your type's tendency to go along with others, doing what they want to keep the peace and be nice. Will constantly acquiescing to the wishes of others provide the kind of relationships that will really satisfy you? Remember, it is impossible to love others if you are not truly present to them. This means that you have to be yourself, that you (paradoxically) have to be independent so that you can really be there for others when they need you.",
                "Exert yourself. Force yourself to pay attention to what is going on. Do not drift off or tune out people, or daydream. Work on focusing your attention to become an active participant in the world around you. Try to become more mentally and emotionally engaged.",
                "Recognize that you also have aggressions, anxieties, and other feelings that you must deal with. Negative feelings and impulses are a part of you and they affect you emotionally and physically whether or not you acknowledge them. Furthermore, your negative emotions are often expressed inadvertently and get in the way of the peace and harmony you want in your relationships. It is best to get things out in the open first, at least by allowing yourself to become aware of your feelings.",
                "Although this will be very painful for you, if your marriage has ended in divorce or if you are having problems with your children, you must honestly examine how you have contributed to these problems. Examining troubled relationships will be extremely difficult because the people involved have been close to your heart. The feelings you have for others endow you with much of your identity and self-esteem. But if you really love others, you can do no less than examine the role you have played in whatever conflicts that have arisen. In the last analysis, the choice is simple: you must sacrifice your peace of mind (in the short run) for the satisfaction of genuine relationships (in the long run.)",
                "Exercise frequently to become more aware of your body and emotions. (Some Nines run around doing errands and think that they are getting enough exercise.) Regular exercise is a healthy form of self-discipline and will increase your awareness of your feelings and other sensations. Developing body-awareness will help teach you to concentrate and focus your attention in other areas of your life as well. Exercise is also a good way to get in touch with and express some aggressions."
            ]
        }
    ],
    "subData": [
        {
            "compatibilityMatrix": [
                1,
                1
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Ones bring the same general qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls of this pair. Two Ones will be concerned with fairness, truthfulness, keeping agreements, schedules, consistency, and treating the other with respect and dignity. Work and taking care of responsibilities will tend to come first, with play and pleasure taking a back seat for this couple. Vacations and leisure, partying and recreation will all be fitted in after the more important things are accomplished. Each will feel like (and take the role of) the adult in most situations, making for a highly competent, rational approach to life and problem solving. In their dealings with each other (as well as with family and friends), two Ones will want to be objective and reasonable, fair and truthful above all else—and will seek these qualities in others. They create an atmosphere of clarity and precision in which their own interactions with each other (and with friends and family) feel clean—not sticky or sentimental or loaded with unspoken ulterior motives. A double One pairing often is created and sustained by shared ideals as well as the desire to put those ideals into practice. Both Ones are typically people who have solid convictions which they enjoy talking about, often with noteworthy articulateness and passion. They also typically have a certain strength of character and a degree of wisdom—which both admire in the other. They could not bear being in a relationship with someone they did not respect and whose character was not sterling. Ones bring their hard-earned wisdom to others, above all, by fighting for tolerance, dignity, and rights of everyone.",
            "troubleSpots": "Potential Trouble Spots or Issues Both Ones are governed by a strong sense of right and wrong as well as a sense of responsibility, giving them a feeling of self-restraint and a tendency to feel responsible both for themselves and for everything else in their lives—including the quality of the relationship itself. There can be a noticeable tone of formality in this combination with a reluctance to say or do anything that would be undignified or out of keeping with their sense of propriety and appropriateness. They will have little tolerance for sloppiness, error, or whatever they define as childish behavior in anyone. Irritation and condescending sarcasm are how they express anger with each other, occasionally exploding into a litany of long-standing grievances that have been loaded in their mental account books. Easily frustrated by mistakes or lapses in themselves, they are equally aware of short-comings in each other."
        },
        {
            "compatibilityMatrix": [
                1,
                2
            ],
            "goodSpots": "Enneagram Ones and Twos are a complementary couple since both offer the other the example of their own qualities. Both types are highly dutiful and are attracted to service roles and occupations: both may be teachers, ministers, or health care workers who have long hours and many responsibilities. One and Two couples are often professionals whose work takes them out of the house and requires the focus of their attention to be on the needs of others, not on the relationship itself or even on themselves personally. People in this kind of relationship are often unusually mature and independent and able to obtain their emotional needs from a variety of people and connections, including their professional ones. They bring high ideals, strong ethical standards, and the desire to serve others to the relationship itself, keeping the relationship strong and in touch with solid values and practical perspectives. The relationship is built around shared values: both are on a path of some kind together. Twos bring the nurturing and feelings that Ones do not easily allow themselves: they help Ones soften and relax. On the other hand, Ones bring integrity, conscientiousness, responsibility, and consistency. They are steady, reliable, and truthful. Ones commit strongly which makes the Two feel secure and that they won't be abandoned. Further, Twos bring warmth, a concern with people and a willingness to make exceptions to the rule for individuals in need. They are aware of suffering and work hard and generously to alleviate it wherever they can. Twos are more convivial and welcoming than Ones and can warm up the One's more typically reserved exterior—which most Ones are glad to have happen.",
            "troubleSpots": "Potential Trouble Spots or Issues For as concerned about the needs of others as Ones and Twos are, ironically, they tend not to be very aware of their own needs or able to express them easily. Ones feel that life is serious business and that work must always come before play; the lower impulses of the self must be held tightly in check. Twos feel that they must take care of everyone else's needs before they are allowed to have needs themselves. Life is about serving others and making themselves useful to so that others will need them and want them in their lives. Both Ones and Twos, therefore, find it difficult to talk about what they are actually feeling, what is actually going on in the relationship, and what they actually want. In this kind of relationship, there are often ulterior motives and unstated agendas, with no one able to admit that they are not getting what they want—much less that they might not be happy or fulfilled. For both, getting what they want feels selfish and forbidden. Ones can begin to feel disappointed by the Two's tendency to give so much of themselves to others and to be so unregulated regarding time and attention. Twos can seem to Ones to be everywhere else serving on yet another committee or charitable group but in the home or at their job, fulfilling their primary responsibilities."
        },
        {
            "compatibilityMatrix": [
                1,
                3
            ],
            "goodSpots": "Enneagram Ones and Threes are both competent, serious minded, and idealistic. This is a highly task-oriented relationship, with both partners driven to hard work and to be intensely aware when, individually and collectively, they are not measuring up to their own expectations and high standards. Both parties can bring selflessness, self-discipline, good work habits, and the ability to put aside their personal feelings for the sake of the objective good that needs to be done. Both types are used to working so hard that they often succeed, garnering admiration from those around them and attaining places of leadership and responsibility. The One and Three combination can be dazzlingly accomplished, high energy, extraordinarily competent and impressive both individually and collectively. They both strive after excellence, both as an ideal and as something to personally embody. Sometimes they succeed so well that this pairing virtually glows with self-confidence and the thrill of their own talents. They strive to make each other proud of them, someone the other can look up to and show off to his or her friends and family. They enjoy planning and organizing their lives, dividing up responsibilities after seeing who is objectively better at which tasks. Both thrive on respect and give each other personal space. There are only two other equally goal-oriented pairings, a One with One combination and a Three with Three pairing, although since these both are same type pairings, they typically have blind spots that these combinations will need to be aware of. Because the One/Three is a mixed pair, this produces a powerful coalition that is capable of dealing both with ideals and with practical matters. They will try to solve problems in the relationship by discussing the issues involved since neither likes emotionally charged bickering or unresolved issues. Ones help Threes to be more grounded and realistic; Threes help Ones stretch themselves and not be so perfectionistic. They are both industrious and persistent, efficient and concerned with excellence and with making a real difference in the world.",
            "troubleSpots": "Potential Trouble Spots or Issues If this relationship gets into trouble, it is often over time commitments, lack of emotional attachment to each other, and a creeping sense of competition. Further, Ones tend to find Threes too workaholic, pragmatic, and too concerned with image and with their reputations rather than with principle. Ones can see Threes as tending to cut corners in ethical matters, willing to exaggerate or fudge the truth in order to achieve whatever they are after. They can also become critical of Threes if they change their goals pragmatically, dropping efforts or switching positions when something does not work for them. Ones may also have issues with Threes attempting to reinterpret ethical questions and with not owning up to their personal behavior, including their behavior regarding fidelity in the relationship itself."
        },
        {
            "compatibilityMatrix": [
                1,
                4
            ],
            "goodSpots": "Enneagram Ones and Fours have an intense mutual interest to bring something good and beautiful into the world. Both are idealistic and concerned with getting it right in their work and self-expressions. Both see how things could be, how a project could become an expression of an ideal form, if all went well. By working together, something universal and transcendent could result in their work and in their relationship itself. Ones bring a desire for objectivity, truth, value, and reason to the relationship. They offer self-discipline, good work habits, and regularity to the relationship. Ones are conscientious and will sublimate themselves and their personal needs for the greater good, including the shared vision and goals that they feel are at the core of the relationship itself. Ones can act as valuable sounding boards for Fours, offering advice and wisdom when Fours get confused by the multitude of their feelings or their self-doubts. Fours bring creativity, intense feelings, sensuality, spontaneity, inspiration, and the ability to tap into dreams, the unconscious, and other universal forces. Their expressiveness and emotionality can be a welcome counterbalance to the One's typical formality and sense of order and reason. Fours give Ones permission to explore and express the full range of the One's feelings and passions. Ones help Fours actualize their dreams by supporting creativity with healthy self-discipline and appropriate structure. In general, Ones bring self-restraint to the relationship, which may act as a model for Fours, who tend to be more unregulated. Both types have a taste for refinement, beauty, and a cultivation of the arts, and if both appreciate what the other offers, they can make a long lasting, productive team that helps balance the limitations of the other while bringing out qualities that each lacks—one of the primary functions of all good relationships.",
            "troubleSpots": "Potential Trouble Spots or Issues A relationship between Ones and Fours can sometimes be like mixing oil and water: they tend to separate quickly because they see things from the opposite points of view. Ones think that they are almost always being sensible and objective, while Fours do not try to be \"objective\"—they want to see things from the subjective, personal side. While both bring a kind of idealism to the relationship, it is usually idealism applied to different things. Ones will be idealistic about social causes, morality, politics, and global issues, while Fours are idealistic, even perfectionistic, about aspects of their personal lives—their lifestyle, their mate, and their choice of work. Both can reinforce each other's sense of superiority, leading to elitism and snobbery toward others. Both can become disdainful and condescending toward those who have less breeding, taste, or sense of refinement—and the habit of being disappointed in others can be turned against each other as well."
        },
        {
            "compatibilityMatrix": [
                1,
                5
            ],
            "goodSpots": "Enneagram Ones and Fives are alike in many ways, particularly in their reticence to show their emotions directly and in their identification with their minds. Both see themselves as fact-oriented, although Fives are more purely mental while Ones like their ideas and philosophies to have practical ramifications. Both bring to their relationship a desire to be objective; they both want to avoid falling into sentimentality, or to allow their feelings to cloud their mental clarity. Ones and Fives share a rich mental life of intellectual stimulation, curiosity, and a multiplicity of mutual interests—from the opera to sports to politics to economics to history, and so forth. Ones and Fives often enjoy each other's company and intellectual stimulation, loving to debate and admiring the intelligence and expertise exhibited by the other. Unexpectedly, they tickle each other's funny bone—this pair loves to laugh together at life's absurdities. Child rearing, traveling, building a house, shared hobbies, or other complex activities are mutually stimulating and bonding for them. They both are highly respectful of personal boundaries, rarely being the one to make the first move in anything regarding intimacy unless they have pretty strong signals from the other that they would be welcomed. Thus, Ones and Fives tend to bring a certain formality and courtesy to each other that can be charmingly courtly and old-fashioned. Ones add to this a concern with logic and order, with systematic thinking, attention to details and the desire to improve the world around them. Fives bring curiosity, the willingness to be intellectually (and sexually) adventuresome, a taste for the bizarre and illogical, and the ability to relish disorder, chaos, and lack of apparent meaning. There is quiet affectionate appreciation in this pairing. If romance develops, it develops slowly but deeply.",
            "troubleSpots": "Potential Trouble Spots or Issues As intellectual as both types tend to be, they are also opposites in important areas, and this can lead to conflicts and the eventual breakdown of their relationship. Most seriously, Ones tend to believe in the objectivity of certain truths and believe that once these are known, there is the possibility of arriving at objective certitude. Ones feel that their ideals and philosophy have given them contact with some form of ultimate Truth, and therefore they are living from a viewpoint in which acquiring certainty is a moral imperative. Fives, on the other hand, feel that there is no such thing as objective truth, merely possible interpretations for what seems to be objective reality. We may come to some degree of consensus, but that does not necessarily mean that our consensus reflects anything completely objective. It just means that we choose to think the same way. Fives are thus skeptics and debunkers of certitude. They love to debate and deflate ironclad philosophies and self-righteously held positions wherever they find them. Thus, less healthy Ones can drift into various forms of fundamentalism, believing that they hold the key to truth, while Fives can become provocative nihilists, believing that there is no truth."
        },
        {
            "compatibilityMatrix": [
                1,
                6
            ],
            "goodSpots": "Enneagram Ones and Sixes are alike in many ways and they are often misidentified with each other. Both types are extremely hard workers, conscientious, serious minded, and have a strong sense of duty and honor. They both care deeply about truth and commitment, and both have a desire to serve others and improve the world. Both have a guiding sense of purpose, often lead by deeply held beliefs and ideals. Of course, they also bring other qualities that are especially their own. Ones bring a sense of reason and mental clarity, the ability to think clearly under pressure and to come to firm decisions quickly. They are more sure of themselves and their opinions than Sixes tend to be, so Ones often serve as the leader in a One-Six relationship, making the final decision and taking responsibility for it. Ones also bring a concern for order and consistency, for logic and elegance that is sometime lacking in Sixes. They may also bring a distinct idealism that has little to do with personal loyalty or hero worship (as it may in a Six). On the other hand, Sixes bring warmth, more emotional responsiveness and availability, generosity, and playfulness that can be endearing and which can make Ones think twice about their certitudes and positions. Sixes also have the ability to connect with people in a more direct and human way than Ones tend to do. These qualities are attractive to the other and they can make this couple a dynamic and yet highly stable team, provided their fundamental beliefs are in alignment. They take responsibility in relationships, sharing burdens and chores equally. They also feel that they can count on the other: they are steadfast, loyal, and faithful to each other, wanting to build a solid foundation together. Because both can count on the other, this gives both room to relax—something they both need to do more often.",
            "troubleSpots": "Potential Trouble Spots or Issues As stress increases, Ones become more critical and judgmental of everyone including themselves and their partner. They tend to be a clear case of all work and no play, making them fairly joyless and difficult to be around even in the average Levels. Ones begin to feel that others are not trying hard enough, are not serious enough, or not mature and meticulous enough—or certainly not as much as Ones are themselves. This creates resentment and accusations and fairly constant bickering which can be extremely wearing on Sixes more than it is on Ones. As they become more stressed, Sixes become increasingly emotionally reactive, worrying and insecure, looking to their partner to be a bulwark of stability and fairness. What Sixes find instead are Ones who are critical, faultfinding, and rejecting—driving Sixes deeper into their feelings of anxiety and insecurity. This often makes Sixes begin to doubt the future of the relationship, feeling that it is likely doomed, which can often become a self-fulfilling prophesy."
        },
        {
            "compatibilityMatrix": [
                1,
                7
            ],
            "goodSpots": "Enneagram Ones and Sevens have a particular complementary and reciprocal relationship. They are opposites who can either bring something needed to the other person, thereby helping both to achieve new growth (or, as we will see) they can drive each other further apart by playing on each other's weaknesses whether consciously or not. Ones bring conscientiousness, orderliness, good work habits, methodical attention to detail, and a pleasure in maintaining excellence and high standards. Sevens bring spontaneity, high energy, curiosity, an orientation toward fun and adventure, the desire to try new things, and an ability to not get too hung up with getting everything done perfectly. Both types can be initiators and planners, future-oriented and idealistic, although Sevens tend to prefer having multiple options and to keep all plans loose enough so that they can be changed as needed. They bring freedom and spontaneity. Ones are more methodical and help Sevens stay on track—they resist getting distracted by too many options, and excel at following through with their plans. Sevens offer Ones a sense of excitement and life as a source of pleasure and enjoyment. Ones offer Sevens a sense of purpose and idealism, as well as direction and the feeling that life is noble and meaningful. Sevens keep Ones' spirits up, refreshing their idealism while preventing the relationship from becoming too heavy. Ones help steady Sevens, keeping them working systematically and consistently toward goals. Sevens appreciate the One's consistency and reliability and are glad to have someone who can attend to details. These two types can be highly supportive of each other as long as their ultimate values are congruent and as long as they are both working for the same fundamental things in life. This tends to be a stimulating relationship for both—they stretch each other and are fascinated and challenged by their differences.",
            "troubleSpots": "Potential Trouble Spots or Issues As stress increases, Ones become increasingly critical, judgmental, inflexible, and insistent that things be done only one way, the right way—their way. They inevitably begin to see Sevens as undisciplined and inefficient, self-centered and childish. Ones feel that Sevens are scattered and tend to fool around too much, over-extending resources and overbooking themselves and promising too much to too many people. Ones also often feel that Sevens are unfocused and scattered simply to annoy them and to get back at them passive-aggressively, without seeming to be hostile or petty themselves. On the other hand, Sevens tend to see lower functioning Ones as too prissy and perfectionistic, and ultimately, as someone who needs to be kicked in the pants to loosen them up a bit. Conflicts between these two types also often focus on organizational and financial matters, with Ones feeling that Sevens are profligate and wasteful while Sevens feel Ones are too tight-fisted and have no vision or pizzazz."
        },
        {
            "compatibilityMatrix": [
                1,
                8
            ],
            "goodSpots": "Enneagram Ones and Eights bring a common concern with fighting for truth and justice in their world. They both often feel (although in different ways and for different reasons) that it is up to them to stand against whatever they perceive as injustice or falseness. Both can see themselves as gallant crusaders protecting the weak, righting wrongs, and making the world a better place. In a relationship, these two types are both action-oriented, and if their attention and energy is turned toward social causes in particular, they can have a big effect on their family and their community, perhaps even their country or the world. Both bring a certain nobility of vision and a focused purpose, practicality, and perseverance in supporting whatever they believe is right. Both are willing to sacrifice a great deal to do what they believe needs to be done. For both, fairness is centrally important. (Ones bring a sense of absolute or ideal truth and justice whereas Eights bring a more practical and immediate approach to these concepts.) The combination can be very powerful: they accomplish things with a clear cut sense of purpose and personal mission. Both are decisive and direct, although Eights bring a passion and gusto that counterbalances the One's self-restraint and propriety. Ones can find Eights exciting, physical, and earthy-all the things that they restrain in themselves. Thus, there can be a strong attraction from both sides. Further, Eights recognize that Ones are as strong-willed and determined as they are: they cannot easily sway or bowl over Ones. Eights thus admire their conviction and are attracted to the challenge of getting closer to Ones. In many ways, these two types are opposites-the pirate and the schoolteacher-although both could learn a great deal from the other, if they are willing to listen to someone with such different values, reactions, and ways of doing things.",
            "troubleSpots": "Potential Trouble Spots or Issues What breaks Ones and Eights up is often the very thing that attracted them in the first place: how different they are from each other, like fire and ice. This is a relatively rare romantic pairing; it is easier for them to be friends or colleagues than to live intimately together. Both want to be in charge; both want to accomplish something significant, but they tend to disagree about the means to take. Ones tend to be self-controlled and restrained in their self-expressions and methods of doing things. They will deny themselves the pleasure of acting on their real desires and impulses if they are convinced that something they want is not right according to their moral convictions. While they may admire the brashness and roguishness of Eights and their apparent ease in going after whatever they want, Ones ultimately begin to draw a line if they see Eights going too far in the pursuit of their self-interest. Ones can begin to regard Eights as selfish, insensitive, aggressive, and morally corrupt. They may admire the outlaw's bravado, but abhor where it leads them and how much chaos and destruction it creates in its wake. Ones can begin to see Eights as crude, untrustworthy, and violent."
        },
        {
            "compatibilityMatrix": [
                1,
                9
            ],
            "goodSpots": "These types understand each other from the inside as it were, and for better or worse, can see many of their own traits in the other. On the positive side, each type brings a certain idealism and desire to change the world to make it a better place. Nines bring a more interpersonal orientation than Ones to their idealism, but both can be self-sacrificial and hard working, and willing to put their personal needs and interests aside for the welfare of others. Both are also able to delay rewards for a long-term good they seek. Ones bring clarity and rationality and the ability to articulate ideals and understandings. They strive to improve themselves and their environment, are conscientious, have high ethical and moral standards, and are fair and consistent. Nines bring a gentle, accepting quality that nurtures and supports others without as much explicit demand for self-improvement. Nines are steady, easy to get along with, feel uncritical and undemanding, and prefer harmony and smooth relations over the pleasure of being right or of having the last word in a situation. In short, Nines tend to take a bit of the rough edge off of the criticality and seriousness of Ones, while Ones give clarity and direction to Nines. Further, Ones feel that they have a mission in life, and they are able to inspire Nines to become aware of their own purpose and to want to follow it. This can be a highly altruistic couple who balance idealism with humanity. As a couple, they are gracious company, hospitable and generous, but they also need time to be alone with each other as a couple. They have a mutual love of nature and animals that may bring them closer together, as well as their love of their children and family. Nines soothe Ones, while Ones remind Nines to strive for excellence.",
            "troubleSpots": "Potential Trouble Spots or Issues The main problem area for Ones and Nines has to do with the opposite ways that they deal with conflicts and rising stress. Ones tend to become more openly frustrated with themselves and others and with the feeling that things are not going as they should. They begin to exude a prickly anger, edginess, and dissatisfaction with everything and everyone. They become obsessed with finding who is at fault, and with legislating how things could be improved. By contrast, when conflicts and stress increase, Nines begin to shut down and withdraw. They become less effective at correcting problems and less able to speak about their feelings or discomfort. The worse things become, the more Nines attempt to tune them out while maintaining that nothing is the matter. Thus, judgments about the Nine's judgment and competence and willingness to take responsibility taint the One's dealings with Nines, while resistance and denial of problems (with a barely suppressed undertow of anger) infect the Nine."
        },
        {
            "compatibilityMatrix": [
                2,
                2
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Twos bring many of the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls of this pair. Healthy Two couples bring a high level of warmth, affection, and sensitivity to each other. They are genuinely concerned about the welfare of their partner and of the relationship itself, and they are willing and able to put out a considerable amount of energy to make sure that all is well. A double Two pair has a high level of communication and checking in between them: two Twos would have no problem discussing how they feel, inquiring about the other's health, about how things are going at work, and so forth. They would also be delighted to help support the efforts of their partner in whatever ways they could. Both individually and as a couple, they are thoughtful, observant of people's needs, generous and respectful of boundaries and the need of others to be independent and to learn things on their own. Healthy Two couples can express enormous affection for others, while at the same time, letting them go appropriately. They also can find a balance between themselves as a couple and each of them as an individual. Interestingly, since neither is used to being nurtured by someone else, they generally need to learn to allow themselves to be loved and helped by the other. If each of the Twos can take in the support of the other, the relationship can become a source of deep love and abundance from which they are able to more fully move out into the world. They feel secure and are loyal to each other, knowing that their partner is there for them. At their best, this is a loving, warm-hearted couple that uses the security of their relationship to raise a family, adopt children, and make the world a richer, more loving place. They reach out to others and build a family of choice, a home that others truly want to be a part of.",
            "troubleSpots": "A couple in which both people are so feeling-oriented may make better friends and work associates than they do intimate partners. The reason is that both are concerned with questions of value and self-worth, identity and gaining validation from others. Their particular set of emotional needs can make this pair more prone toward secret jealousy and competition with each other about who is more loved, who is the center of attention, or who is being sought out more frequently for advice or for social events, and so forth. In some double Two couples, whether males or females, they will be aware of how people respond to them physically and sexually. Different forms of charm to outright displays of sexual prowess will be part of the picture, although this will get in the way of a satisfactory exclusive intimate relationship. Some Twos will attempt to solve this problem by going in the opposite direction by beginning not to care about what they look like. They may not exercise and gain excessive weight, for example, or not dress or groom themselves sufficiently. A double Two may begin to find their emotional consolations elsewhere, seeking intimacy with others or, if that is not possible, with food. If this continues, they may gradually lose all physical interest in each other and the relationship would suffer from loss of contact and physical intimacy. If health issues subsequently become a problem (due to overeating as a compensation for emotional deprivations) the physically healthier Two will inevitably feel held back by the needier partner. Or both Twos could deteriorate into a sickbed centered relationship in which their illnesses and their complaints about them are what hold the couple together. They may both develop boundary problems and get overly enmeshed with each other—or, just as likely, become repulsed by the other's hovering. The worse this gets, ironically, the more isolated and lonely they become. Depression and blaming the other are often part of the picture."
        },
        {
            "compatibilityMatrix": [
                2,
                3
            ],
            "goodSpots": "Both Enneagram Twos and Threes are driven by their feelings and emotional needs-although this is not always apparent in the case of Threes. Both are also driven by their need for attention and the desire to be loved-although this is not always apparent in the case of Twos. But for these reasons, both are oriented toward people and toward activities that will place them in the spotlight. This makes the Two/Three couple one of the most interpersonally attractive and impactful pairings possible. Individually and collectively, they are outgoing, sociable, high-spirited, charming, and often physically attractive. Both know how to make a favorable impression on people and to win them over. Each type brings energy, personal and social ambition, the ability to communicate with people and to make others feel like they are the center of attention. Both know how to get people to like them and to rally support to achieve their goals. Twos in particular bring a more personal, individual focus to their interactions with others. They are thoughtful and follow up exchanges with genuine kindness and compassion. Threes bring flexibility, charm, practicality, and a goal-oriented vision for ways the couple can improve. Twos like to feel proud of their loved ones, and Threes want to make their partner proud. There is also a particular way that this pairing works as a team: Twos like to put the spotlight on others, and Threes like to be in the spotlight. Twos like to be the power behind the throne, and Threes can be happy being the point person for the couple. As long as healthy Threes appreciate the lavish attention of the Two, this arrangement can work well. In a sense, this is almost an ideal political couple—socially adept, energetic, virtually radiating charm and self-confidence, inviting others (by their manner and attractiveness) to join them in some way. Twos and Threes can be dazzling—a couple so widely admired and socially gifted that they become icons for their social sphere and time.",
            "troubleSpots": "Potential Trouble Spots or Issues A couple with such conscious star power also tends to be self-conscious—and even more conscious of each other. Twos get jealous and possessive of Threes. They can fall into a \"I made you—you owe me\" syndrome, feeling used and unappreciated. For all of their apparent willingness to take second place, Twos want to be recognized privately by their partners and to be made to feel that they are important. But Threes typically find it difficult to thank others for their success or to share the glory. Moreover, Threes may feel that Twos overestimate their contributions: they take credit for too much, sometimes, embarrassingly, in public. As a result, Twos can start to undermine the Three's confidence to get the Three to feel that he or she depends on the Two. Threes react quickly and strongly to perceived criticism and potential humiliation by distancing themselves—inevitably creating more anxiety and manipulation in the Two, a vicious cycle."
        },
        {
            "compatibilityMatrix": [
                2,
                4
            ],
            "goodSpots": "This can be a very warm, even passionate, couple when both parties continue to share their feelings openly together. Both are seeking warmth and connection, and both are willing to provide it when they are healthy. Hence, once they have gotten over the initial hurdles of intimacy, Enneagram Twos and Fours can be a safe place for each to share their hopes, fears, and insecurities. They can be good medicine for each other: Twos contribute sociability and energy, giving Fours the confidence to interact more easily with others. Twos are warm, outgoing, thoughtful and considerate, generous, and encouraging. Twos are also practical and action-oriented, willing to pitch in where needed and to do the things that need to be done, no matter how unpleasant or unglamorous. To this mix, Fours bring creativity, a sense of humor, a willingness to laugh at human foibles, and emotional honesty. They see their own craziness and their own falseness and they do not try to varnish the truth of their quirks from themselves or from the Two. Fours also bring a sense of beauty and of subtlety into the relationship: they care about how things impact on themselves and others, and so they go out of their way to arrange their world to be more aesthetically pleasing, allowing the Two to feel more relaxed and nurtured. Fours also bring emotional depth and sensitivity to their relationships, a sense of mystery and unpredictability, sensuality and sexual freedom. In short, Fours invite Twos to take a closer look at their deeper needs, the truth of who they are and what they actually feel. Twos appreciate the subtleties and nuances that Fours bring, and Fours thrive in this atmosphere of appreciation. They can lighten up each other with unexpected humor and appreciation of each others' quirks. Each invites the other to mature emotionally, usually without saying so. Both help the other to stop being so concerned about what others think of them and to become more inner-directed.",
            "troubleSpots": "Potential Trouble Spots or Issues Usually Twos and Fours make better friends and colleagues than intimates. Surprisingly, this pairing is rare in intimate relationships. One would think that they would be a natural fit with each other: the rescuer (Two) and the rescued (Four), the lost child and the parental figure. The problem is that there can be too much emotionality and unspoken demands in this pairing for their own good. Twos and Fours tend to have many emotional issues in common-which allows them to understand each other readily while also laying the groundwork for potential problems and conflicts. They both need closeness and intimacy and tend to cling to anyone who responds to them sufficiently. Over the long term, there is the tendency to become competitive for attention or for one person to feel better liked and more appreciated than the other."
        },
        {
            "compatibilityMatrix": [
                2,
                5
            ],
            "goodSpots": "Enneagram Twos and Fives are double opposites, as it were—a people person versus a loner, a feeling type with a thinking type. Twos and Fives come from different points of view on what is important in life and in a relationship. And yet, because they are so different, there can also be an intense attraction to the mystery of the other. Twos and Fives are a more common pairing than might be expected: Twos can see Fives as challenges—distant, mentally preoccupied, not giving many outward signals, and difficult to charm easily because they are so private. It is hard to know what pleases Fives which makes Twos only try harder. Twos bring to the relationship a willingness to take the initiative and to pursue the Five—to be the first one to call or to ask for a date, no matter which gender they are. When healthy, Twos bring warmth, physical comfort and ease (something Fives typically lack), a desire to improve the Five's living conditions, style of dress and eating habits—and many other marks of thoughtfulness-as signs of affection and genuine interest. Fives are usually not unaware of these, though they may not outwardly react to the expressions of affection of Twos, Fives are secretly pleased that anyone cares and is being attentive to them. For their part, Fives are usually very loyal: they find relationships complex and difficult, so they tend to value one that begins to work, and they tend to put energy into it. Fives bring stability and quiet, dispassionate good judgment and objectivity, particularly in crises. When Fives focus, they are good listeners and give undivided attention. They are not as attached to outcomes, and so can often make decisions more wisely and be good advisors to more emotionally volatile Twos. Fives are often more calm than Twos, and this gives them both types a feeling of steadiness and of hope. In short, Fives stabilize Twos' emotionality, while Twos warm up Fives' coolness. Twos enjoy seeing that their attention and affections have had positive, visible effects on the Five. Fives secretly like being doted over and finally finding the nurturing they have unconsciously been seeking (but may have almost given up on).",
            "troubleSpots": "Potential Trouble Spots or Issues Many of the issues that this couple faces have to do with their boundaries and how respectful or not each is of the other. Twos tend to become frustrated by the Five's lack of immediate response to them—sometimes Fives are so taciturn and involved in their own mental world that there is no response at all—which hurts the Two's feelings and feels like a rejection to them. Feeling rejected triggers deep anxieties in Twos relating to the fear that they are unwanted and unloved. This may make them redouble their efforts to get some kind of response from the Five. They may become more talkative, more curious and questioning of the Five, and more demanding-physically hoisting the Five from her desk, or barging into her library to drag her out dancing or to a movie because she needs a break from work. Much of the Two's activities become a form of intrusion that has at its root the need to reassure himself that the Five is still connected with him."
        },
        {
            "compatibilityMatrix": [
                2,
                6
            ],
            "goodSpots": "Both Enneagram Twos and Sixes are highly dutiful and take their responsibilities toward each other very seriously. The emphasis tends to be slightly different, however, with Twos focused primarily on building intimacy and positive feelings between themselves and other individuals, whereas the emphasis of Sixes tends to be on building a foundation of security, a sturdy platform of hard work and trust that everyone can count on. Both types are highly responsible and tend to put the needs of others before their own. They are both family oriented and foster domesticity; they easily share duties around the house and with their children or friends. They are both socially involved in their community and see great value in having many social connections which give them the feeling that they are valued in their world. Sixes value the warmth, kindheartedness, generosity, and self-sacrifice of the Two. Sixes are aware of how well suited Twos are to be an excellent, devoted spouse and parent, and that they could be trusted to be loyal. On the other hand, Twos will likely admire the hard work, steadfastness to commitments, perseverance, modesty and playfulness of Sixes. Even if they should sometimes be grumpy and indecisive, Twos realize that healthy Sixes almost always come around in the end. Caution and vigilance are recognized as worthwhile assets in what can be a cruel and exploitative world. Twos often feel that they can count on the Six's watchfulness to spot difficulties before they become problems. When Twos and Sixes are healthy, they may actually admire each other more than they feel a grand passion for each other. Their relationship may be based more on steadiness, mutual respect, and affection than on some kind of overheated chemistry between them. They see the other as good and dependable, and that is often more than enough as a basis for an enduring and productive life together.",
            "troubleSpots": "Potential Trouble Spots or Issues One of the main potential areas for problems between Twos and Sixes has to do with control and autonomy, between being too close and being too far apart. Part of the problem has to do with the lack of confidence of lower functioning Sixes and their ability to make decisions and to be decisive. Average Sixes tend to feel pressured by all kinds of competing demands on their time and energy—by the Two, by the boss, by friends, by their church, and even by their country. Pressure from all sides makes Sixes feel more anxious and emotionally unstable, unable to think clearly or to make decisions easily. They can become doubtful, suspicious, and negativistic. As Sixes become more reactive, they are likely to impulsively take almost any action just to relieve their anxieties momentarily. At such times, Twos may begin to offer them more help and advice, or to issue \"orders\" as a way to empower the Six and help them through their anxiety."
        },
        {
            "compatibilityMatrix": [
                2,
                7
            ],
            "goodSpots": "In many ways, both of these types can look alike. Both Enneagram Twos and Sevens can be outgoing, friendly, funny, high-energy people and very enjoyable company. They want others to be happy and to have a good time, and both types tend to interpret things (including setbacks) in a positive way—always looking for the silver lining or the blessing in a seeming disaster. Both types are engaging, spontaneous, and love the good things of life. In addition, Twos bring a depth of feeling and concern for the welfare of others into the mix. Twos admire the nerve and gusto with which Sevens plunge ahead in life, making everyday an unpredictable adventure. Sevens bring high energy, and a quick mind that sees possibilities and generates ideas faster than they can be acted on. There is a kind of mental electricity and excitement that Sevens generate—the aura of sheer possibility that Twos find intoxicating, not only for themselves but for those they want to share their excitement with. The Seven helps the Two to remember to do nice things for themselves on a regular basis. They remind Twos that if they are not taking care of their own health and fulfillment, they will not really be able to be helpful to others. On the other hand, healthy Sevens feel that their emotional and physical needs are largely met by a healthy Two. The Two helps the Seven feel relaxed and fulfilled, reducing the temptation to wander. Further, both Twos and Sevens are idealistic, but Twos can more easily and consistently translate this impulse into altruistic action. This inspires the Seven who also enjoys sharing their abundance with others. Together, they can be remarkably generous and thoughtful as a couple. The Two and Seven combination can have a positive effect on people that is virtually unmatched by any other couple: they can be warm, welcoming and generous, making others feel loved and invited to the party.",
            "troubleSpots": "Potential Trouble Spots or Issues In time, Twos feel that they can never have enough intimacy and they usually try to find ways to be closer to the Seven. They like to stay at home, go on quiet walks together, cook, and talk about settling down and having a family. Sevens, on the other hand, generally find the idea of settling down and limiting their options to be no where nearly as attractive to them. Sevens are capable of long-term commitments, but they tend not to be eager to get into them. As a result of these signals, the Two may start to hover and become more intrusive, pulling in the reins on the Seven, insisting that they have more quality time together. Sevens can easily feel trapped by this maneuver, and they may begin to lose interest in the Two, feeling that the relationship has gone stale (rather than realizing their own anxiety over the potential closing of options). Twos will increasingly want to get serious about the relationship just as the Seven begins to feel bored or that the relationship has gotten heavy and unfulfilling. Twos can thus begin to see the Seven as untrustworthy, a playboy (or playgirl) who is selfishly leading them on with no intention of tying the knot. Sevens can begin to see Twos as possessive and manipulative, playing on their guilt or insecurities to make sure the Seven does not stray."
        },
        {
            "compatibilityMatrix": [
                2,
                8
            ],
            "goodSpots": "These two types are more alike than they might appear to be at first. Both are action-oriented and want to have a personal impact on their environment. Both can be sentimental and deeply feeling, with a soft side that is often more hidden than apparent. Both can play the roles of provider, protector, caretaker, and nurturer while avoiding or even denying their own needs. Both tend to overwork themselves and both tend to be the strong one in relationships (although Twos will tend to do so as the power behind the throne while Eights will tend to clearly be on the throne). Both types bring passion, vitality, interpersonal and social skills, magnanimity, and generosity. The basic emphasis of both types is distinctly different, however, with Twos being primarily interested in the welfare of others while Eights tend to be interested in their physical wellbeing and in having a distinct impact on their world, often with beneficial fallout for others. They easily play roles that the other needs and wants: the Eight is practical and concerned with results, whereas Twos are more people-oriented and more openly altruistic. They are both strong willed and like taking on responsibility, as long as they choose it themselves. Eights often bask in the glow of the Two's affection and adoration: Twos truly appreciate the Eight's strength and efforts—and see their often hidden self-sacrifice. Both see each other's noble qualities and can be each other's staunchest supporters and admirers. Their roles are also clearly delineated, so they do not get in each other's way. Each runs different spheres of their lives and cover different bases (one plays the symbolic Mommy the other the symbolic Daddy and things are clear and balanced). These qualities make this couple powerful allies who complement each other's strengths, particularly the good effects they can have on others.",
            "troubleSpots": "Potential Trouble Spots or Issues Twos and Eights have very different value systems: as noted above, Twos tend to be person oriented, while Eights tend to be practical minded. Their interpersonal styles are also very different, with Twos tending to be more empathetic and indirect and Eights being more direct and independent. Even average Eights tend to become proud of their resolutely unsentimental way of dealing with people and situations, while average Twos become highly attached to people and overly-solicitous about their needs. Twos tend to see things from the points of view of others, while Eights do not: they see things from the point of view of self-interest, feeling that others need to learn to take care of themselves lest they become weak and ineffectual. Thus, in a relationship, Twos and Eights have very different ideas about where other people fit into the picture, including their own family."
        },
        {
            "compatibilityMatrix": [
                2,
                9
            ],
            "goodSpots": "Enneagram Twos and Nines are similar in a wide variety of areas and reactions; both types are interested in nurturing others and in helping people to be better, more comfortable with themselves, and more at peace. Both types also tend to be optimistic and to reframe disappointments in the most positive way possible. This pairing has an outstanding warm, kindly, and good-natured quality about it that each side reinforces. Twos and Nines are easy-going, hospitable, and undemanding, happy to make friends happy and to welcome them into their home. Twos bring to the pair a more outward and interpersonally engaging energy: they would most likely be the first to introduce themselves at a party or to go to someone's aid and comfort if they perceived that the other person had some kind of problem. Twos are proud of their relationship, their home, their family and their friends—and they want to share them with others. Twos constantly add energy and new people to the relationship mix. They are more talkative than Nines and more openly curious about other people, how they live and what they are like, and more eager to get involved in others' lives. On the other hand, Nines bring a quiet steadiness and uncomplicated directness that allows people to flourish and things to get done with a minimum of stress and conflict. Even if Twos become upset about their relationships, or are feeling moments of self-doubt about how loved they are, Nines have a way of calming them down and of providing a great deal of unquestioned acceptance. Both types are drawn to each other to provide soothing and support; their home and hearth, pets and love of nature are extremely important to them. Both go out of their way to be considerate of each other, as well as of other people. Much of their best communication is non-verbal, physical, arising from their simple, direct presence to each other. They can develop almost a psychic link with each other. This is a very mellow couple, whose emphasis on hospitality reminds people of how healing it is to be around loving, generous people.",
            "troubleSpots": "Potential Trouble Spots or Issues Both Twos and Nines tend to give away their power and to go along with the agendas of others. Yet, one of the parties will have to wear the pants in the family, taking charge and making decisions. Doing so goes against the grain of both types, although either will take charge if necessary. However, negotiating power and decision making in a Two/Nine couple puts both parties under increasing stress and both tend to feel that they are being forced into the bad guy role in the family—and that they will be resented and unloved while their partner gets off the hook."
        },
        {
            "compatibilityMatrix": [
                3,
                3
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Threes generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. Two Threes bring to each other a concern for achievement and excellence, for making something of themselves and their opportunities, and for being a credit to the relationship. They are both hard workers, always looking for a way to improve their station in life and to share these benefits with their loved ones and friends. Threes also tend to be sociable and to enjoy the company of others. They have the ability to charm others and present themselves in a favorable, attractive light—even to their spouse or close friends. Some Threes are less sociable and more concerned with business matters and with gaining financial security, but they too, want both themselves and their relationship to be admirable and outstanding in some way. They may be known for their closeness or personal devotion, or the longevity of the relationship itself. Both Threes can form an extremely effective team that is likely to be successful in virtually any endeavor they might pursue. They are able to coordinate tasks at home or in the office, becoming a working team supporting each other. They each want the other to be proud of them and to be admired by the other as a worthy partner. They both try to avoid drama in the relationship and they give each other space to pursue their own interests and self-development. Double Three couples are usually excellent motivators of each other, urging the other to higher achievement and to attaining their goals, whether in child-rearing, education, or sports and physical fitness. They can act as the coach of the other, helping the partner to improve their technique and hone their professional and personal skills. What they demand of each other is respect for their achievements and for their hard work. Thus, in many ways, two Threes can make an impression on others of being virtually an ideal couple,—attractive, energetic, ambitious, focused, and often outstanding members of their social group.",
            "troubleSpots": "Potential Trouble Spots or Issues As long as a Three couple is healthy, they both tend to be highly supportive of each other and the other's interests and career. They are glad for the success and prestige that their spouse may garner. Problems may arise in average to lower-functioning Three couples if they begin to compare themselves with each other. An unhealthy spirit of competition and one-upmanship can infect the relationship and undermine the pride and generosity they have felt toward each other. Even if they have different careers, two Threes may begin to compare their relative success, their incomes, how well each is regarded professionally—and what their relative chances for advancement are. One partner being elected to a committee or board of directors puts pressure on the other to do something similar or even more prestigious."
        },
        {
            "compatibilityMatrix": [
                3,
                4
            ],
            "goodSpots": "These two types can form something of a complementary relationship, with each bringing important qualities to the relationship that the other generally lacks. Enneagram Fours can teach Threes how to talk about themselves on a deeper level and help acknowledge and process their feelings. They can also bring Threes more sensitivity, a feeling for beauty and for the non-practical but fulfilling aspects of life. Finding the Three's heart's desire is an extremely important area of self-awareness in which Fours can play a helpful role to Threes. Fours can bring a sense of style and presentation, rich communication, and sense of refinement. Threes model many of the qualities that Fours would like to develop in themselves, and Threes are well-suited to helping Fours gain new skills. Threes can bring a good deal of tact and diplomacy to handling Fours' emotional reactions and their sometimes too-sensitive feelings and self-doubts. Knowing what to say and when to say it-and what not to say—to a Four can be crucial for building trust in the relationship and avoiding inadvertent episodes when either feels humiliated or embarrassed. Threes can bring a sense of hope and ambition to the relationship, practical goal-setting, coaching and behavior management techniques that help Fours get out of a slump or a period of low energy. Threes can coach Fours on how to get on with practical matters and to act professionally despite the shifts in their feelings and self-doubts. Since both types are driven by (often unconscious) feelings and reactions, this can be an intense and passionate coupling. Both are aware of \"image\" issues and about how others perceive them, and so this couple will be noteworthy for its energy, flair, sense of style, and enjoyment of the finer things of life. They may both feel a connection with the other that goes beyond words or reason into another realm as if they had known each other from a previous existence or that the other is some kind of soul mate.",
            "troubleSpots": "Potential Trouble Spots or Issues Both Threes and Fours have issues with self-esteem and with needing attention and validation from others. They both suffer from questions about their own identity and have hidden feelings of shame and worthlessness. These two types secretly compare themselves with others and have more or less openly competitive tendencies. Much will depend on how narcissistically wounded each person is—and therefore how much they will be vying for approval, attention, and recognition. Both Threes and Fours need attention and to feel appreciated, although Threes will be more able to openly seek these things. Fours can feel overshadowed or shut out of the limelight by the more energetic Three. This can trigger feelings in Fours of being defective and deficient, which Threes may play on. Threes will tend to give less attention than Fours to the relationship itself, although both will tend to see the other as essential for their welfare. Fours will typically want far more emotional involvement and intimacy than Threes are comfortable with (or even capable of providing)."
        },
        {
            "compatibilityMatrix": [
                3,
                5
            ],
            "goodSpots": "This is a frequently seen combination, although one that might not be expected. Enneagram Fives often give Threes depth, new areas of expertise and credibility, while sparking creativity. Threes give Fives confidence, presentation skills, and awareness of the importance of communicating effectively with others. Both Threes and Fives are primarily focused on their work and on objective issues and concerns. Both types are preoccupied with competency and effectiveness, especially in their professional areas, and this is where they support each other in an outstanding way. Although both have deep feelings, both tend not to focus on them for the sake of getting on with their work. They tend to understand each other's need to balance closeness with their need for personal space: they do not crowd each other. Threes contribute social skills, the ability to communicate and to sell ideas and projects, charm, energy, and a strong sense of practicality to the relationship. They can often see what is needed in the relationship or in the world and help to marshal the Five's skills toward that goal. Fives bring depth of understanding, expertise in one or more areas, perseverance with details until the goal is accomplished, an objective dispassion, and lack of attachment to outcomes. This can be a \"brilliant\" couple—sharp, successful, deeply competent, and well respected. If they are attractive, Threes can be a trophy for Fives who are usually less concerned with appearance; Fives, on the other hand, can also be a trophy for Threes who are proud of the Five's expertise and who are glad to learn from them whenever they can. Both regard the other as a catch who enhances their own self-esteem and social standing. Their deep, often unspoken, feelings for each other frequently deepen even more over time, gradually allowing this couple to discover not just passion but quiet affection and pride in each other.",
            "troubleSpots": "Potential Trouble Spots or Issues This couple's emphasis on work and competency can also lead them into conflicts and tensions with each other. A great deal of their self-esteem is also derived from their work and how it is regarded by others. Threes and Fives can get into more or less open contentiousness over who was the original source of ideas and work. There can be elements of comparing one's work and contributions, claims about who is responsible for which ideas or breakthroughs, and other forms of competitiveness coming not only from Threes but from Fives. Threes also tend to want to get on with the project or with whatever they feel needs to be done, while Fives tend to take a long time fine tuning and tinkering until they feel that they are adequately complete. Conflicts can erupt over use of time, resources, and priorities as the more practical minded Three becomes increasingly impatient with the Five's lengthy preparations but lack of action. Fives may also begin to lose respect for the ethical standards of Threes who they feel are ready to cut corners or exaggerate claims in order to accomplish goals or to stay ahead professionally."
        },
        {
            "compatibilityMatrix": [
                3,
                6
            ],
            "goodSpots": "Surprisingly, this is not a common pairing, although these two types can work very well as a team. On the positive side, Threes bring hard work, optimism, energy, a desire to communicate to and connect with people, and a feeling of unlimited potential both personally and in the relationship itself. Threes can bring an enormous sense of self-confidence and the hope of success that is assured—that this relationship is a winning team or that this couple is the best ever! Common goals bring them together—they are both practical and want to achieve tangible things in the world. Sixes bring grounding, industrious hard work, perseverance in difficult times and personal loyalty to the Three. Sixes provide warmth, support, and a great deal of practical good sense. Sixes can also bring a compassion for the downtrodden or the less fortunate in life. Threes can pick up on this compassionate quality in Sixes and learn to open their own hearts more deeply to the underprivileged and the unfortunate. Both believe in applying elbow grease toward goals, whether toward financial security or developing personal talents. In short, they are both doers. They foster equality and mutual respect for the different talents each brings and the shared interests they invest in. Threes help bolster the Six's confidence and develop their self-esteem. Sixes offer support to Threes without Threes feeling smothered. Sixes also help Threes to become part of something bigger than themselves-a church, a service organization, a political or spiritual group. Both become stronger individually and as a team by \"finding themselves\" through service and humble hard work. Respect for each other can grow as each continues to discover the other's good qualities. This can be a very enduring and successful couple as long as heart-centered values and deeper principles keeps them both grounded.",
            "troubleSpots": "Potential Trouble Spots or Issues Ultimately, each has what the other needs, but unless their relationship is healthy and well stabilized, they can tend to bring out the worst characteristics in themselves and in each other. These two types have similar negative qualities in common: both can be competitive and become workaholics, both are looking externally for reassurance to make up for secret inferiority feelings and insecurity, both want to be socially accepted. Both can be conformists of various kinds, doing what is expected of them, and both avoid looking at their deeper feelings or discussing their emotions. Both Sixes and Threes have feelings, but they tend to put them aside in order to get the job done whatever it is. Their different coping styles can get on each other's nerves by reminding them of their own weak spots. Threes seem to be inflated and grandiose to Sixes; Sixes seem to be nervous and reactive loose cannons to Threes. Sixes err on the side of caution, Threes on the side of too much ambition."
        },
        {
            "compatibilityMatrix": [
                3,
                7
            ],
            "goodSpots": "This is a highly complementary pair: both types are self-assertive, have high energy, and are outgoing and capable of being around people with relative ease. Both types bring optimism, a future orientation, the sense of possibility and renewal to their relationships and to enterprises they become involved with. Threes can work alone more easily than Sevens, although both are stimulated by interacting with people and both can be excellent communicators of their ideas and values. Both are persuasive and articulate, often lively and attractive, making them sought after company. Both have a youthful orientation such that they feed off of each other's energy: no other couple is as vivacious or gregarious as the Three/Seven couple. This is probably the highest energy combination of types and they wholeheartedly engage in lots of activities, plans and projects, with the emphasis on attaining the good life. The focus is on sociability, going out, having adventures together and on realizing possibilities and on finding personal fulfillment. To this mix, Threes bring sensitivity to people and how to communicate with them, a sense of propriety, appropriateness, and social conventions, as well as the ability to focus on goals and get them accomplished. Sevens bring a sense of fun and adventure, resilience, and not being overly concerned with failure. Sevens can be spontaneous in ways that are helpful to more self-conscious Threes. Sevens bring breadth of knowledge and experience, boundless enthusiasm and good spirits. Threes bring a focus on goals, on staying practical and grounded, and on observing healthy limits. This can be a fun, articulate, generous pair, virtually sparkling with vitality and the joy of life. This can sometimes seem to others to be an almost magical couple.",
            "troubleSpots": "Potential Trouble Spots or Issues This is also an extremely volatile couple: there is almost too much electricity under one roof. A Three/Seven pair always looks like a great couple, but this can also mean having to live up their own hype. They can be exhausting to keep up with and their mutual qualities make it difficult to admit to or look at problems. They both feel the pressure to be \"fabulous\" and perfect all of the time. Both types seem light-hearted, and unconcerned; yet, in their high-energy routines they often hurt each others without realizing it. Often this results in a backlog of past hurts that have been suppressed until it is too late and too much damage has been done."
        },
        {
            "compatibilityMatrix": [
                3,
                8
            ],
            "goodSpots": "These two types can form powerful and highly effective affiliations and can also have passionate and stimulating personal relationships. Both are assertive: both Threes and Eights go after what they want in life. Both can be larger-than-life figures who are outstanding in some way and because both stand out in their social circle. They cannot help but notice each other and come to terms with each other. Either an alliance forms that will enhance both parties or a competition develops that will keep them apart. Surprisingly, Eight's strength and solidity gives Threes permission to be more heartfelt: the Eight feels reliable and Threes seek safety to reveal their hearts. Eights also like seeing Threes use the opportunities and rise to the challenges they offer. On the other side, it helps Eights to relax once they see that the Three is competent and can do things on their own. Moreover, both Threes and Eights are action oriented, pragmatic, care about getting the job done and are willing to take the lead to achieve their goals. They both have a marked degree of self-confidence (at least outwardly), they can be persuasive, and they can cut their losses and change goals when things are not working for them. To this mix, Threes bring more awareness of others, a feeling for public relations and for how to please people. They are more diplomatic and adaptable, both in their relationship with Eights and with others. Eights bring forthrightness in expression, fearlessness, physical vigor, and determination to achieve their personal vision. They bring solidity, decisiveness, and a kind of strength that the more flexible Three gains confidence from. They want to be proud of each other and to support each other's potentials and accomplishments. They tend not to compete with each other—surprising because both tend, in general, to be competitive with others.",
            "troubleSpots": "Potential Trouble Spots or Issues Threes and Eights can be effective in the business world and in their professional careers where energy, determination to succeed, and personal drive are necessary. But both types tend to be workaholics, putting themselves under tremendous stress in order to achieve their goals and to hang onto to whatever success they have. Under sufficient stress, they may stop supporting each other and compete to top the other's achievements. Of the two types, Eights are more openly controlling than Threes, although Threes will attempt to control situations covertly—which can arouse the Eight's suspicions and lack of trust. Once trust is compromised, Eights can become jealous and possessive, ordering the Three to do things to prove their personal loyalty to the Eight. Threes may easily feel used and belittled, not adequately appreciated for their contributions or for their support of the Eight. Eights begin to expect and demand loyalty—even obedience—for their patronage and guidance. Threes begin to feel that they are losing their ability to pursue their own goals, that they are becoming an appendage of the Eight."
        },
        {
            "compatibilityMatrix": [
                3,
                9
            ],
            "goodSpots": "This is a fairly common pairing. Nines bring enormous support, encouragement, and a sense of pride in the Three's accomplishments. Threes can feel that with the Nine behind them, they are able to be themselves, explore their potential, and become the best mate, friend, or professional that they can be. Threes can help Nines to properly value themselves, to have more self-respect, and to invest in their own development. Nines can help Threes relax and find enjoyment in simple things—Nines give them permission to not drive themselves so much. Both types also want to avoid conflicts and to put a positive spin on things—Nines are genuinely optimistic and look on the bright side, while Threes focus on being positive and hopeful, and are careful to not let people see them being down or depressed. Both types are sociable, idealistic, caring for children, animals, and the underdog. Both are usually hard working and want to achieve a degree of material success that will enable them to take care of others in a kind of extended family where everyone would be safe, comfortable, and thriving. They both want a pleasant, aesthetically pleasing home. To this mix, Threes bring energy, personal ambition, flexibility, the ability to set and achieve long term goals, and efficiency. Threes energize Nines and bring change and excitement to the relationship. Nines bring a feeling of safety and steadiness, the assurance that the Three is loved for themselves and not just for their achievements, and the feeling of not being judged or evaluated at every moment. Threes feel that they can let down their hair and really be themselves with Nines who accept them just as they are. The sensuality of the Nine and the attractiveness of the Three can meet in a couple highly attracted to each other and attached by physical passion. In other Three-and-Nine couples, the need for comfort and security may be the main source of attachment and the pleasure they get from each other.",
            "troubleSpots": "Potential Trouble Spots or Issues The Three/Nine couple can almost be a case of \"too much of a good thing.\" Because both types are attracted to keeping the positive values in their lives alive—and there can be so much attachment to comfort and stability in their world—that it becomes difficult to question the status quo and the routines that they get into. Neither wants to bring up conflicts that they have with the other. Nines are more likely not to want to talk about whatever is bothering them for fear of further endangering the relationship. But Threes also do not want to express their complaints because doing so will risk rejection and may also expose the fragility or even the falseness of their relationship. Nines feel that it is better not to say anything and to let things work out on their own, if that is at all possible. If Threes are heavily invested in having a \"perfect marriage\" to the outside world, it will be difficult to talk about their unhappiness in the relationship or the frustrations they are feeling."
        },
        {
            "compatibilityMatrix": [
                4,
                4
            ],
            "goodSpots": "As with all double-type relationships, two Fours generally bring the same qualities to each other. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. Double Four pairs generally make good friends and deep friendship is something they often bring to their intimate relationships. Fours often feel misunderstood, yet feel a special bond of understanding with other Fours. They share stories of their childhood traumas, their private dreams and disappointments. Both types are openly emotional and sensitive to the needs of the other. Both are looking for adequate mirroring and in a double Four relationship, they have a real possibility of finding it. Because each person in a double Four couple is so attuned to their own emotions, there is a great deal of sensitivity and respect for individuality and each other's emotional needs. They have the ability to laugh at themselves and to find amusement with each other in the dark loneliness of the childhood and adolescence. They are not put off by unearthing deep psychological and personal issues. Both are encouraging of the artistic and creative efforts of the other and find it easy to communicate about the most private and intimate issues as they arise. They feel that their relationship is a truly safe space where the other is on a similar emotional wavelength: both feel less alone and less like something is wrong with them personally. Double Fours are highly romantic and idealistic as a couple and their intimacy has the potential to grow into a grand passion of virtually operatic proportions. Emotional ups and downs, hopes and disappointments, elation and despair tend to make this couple more focused on itself than on practical life, child raising, or their careers. Enormous candor, deep friendship, and consideration for the unique history and emotional needs of the other would be hallmarks of this relationship.",
            "troubleSpots": "Potential Trouble Spots or Issues Emotional instability of the relationship itself is the main potential problem with a double Four intimate couple. Each person can be self-absorbed and excruciatingly aware of what he or she is getting (and not getting) in the relationship. Both want to be the focus of attention regarding emotional issues. Both want special handling—and insist on having special needs and they can resent the other for demanding the same for themselves. Both long for an ideal mate—and the feeling that one has found it—can alternate with depression (and other reactions) when expectations are disappointed. They can get into \"Who's more damaged?\" contests, a form of negative competition. Both are more or less secretly looking for a rescuer and can get lost in a morass of emotional drama even if they find one."
        },
        {
            "compatibilityMatrix": [
                4,
                5
            ],
            "goodSpots": "Both types bring a certain richness and special qualities of aspects of human development: Fours bring an artistic and emotional temperament, the habit of introspection and sensitivity to feelings in themselves and others. Both types are private and like depth, and they do not mind taking time to explore things deeply and to savor the richness of their own experience. Enneagram Fours and Fives may well have different interests but they appreciate different perspectives and respect the other's intensity and commitment to following their own feelings and interests. Fives bring an inquiring, intellectual temperament, the habit of asking questions and of being interested in a wide variety of things and of being willing to break with old conventions. Fours contribute an appreciation of aesthetics and of the effect that ideas and discoveries have on people: feelings and unconscious processes are powerful and are not to be taken lightly. Both types can be extremely creative and both love to share their findings with the other, making stimulating, wide-ranging conversation and open communication a hallmark of a Four/Five relationship, both in the intensity of their conversation and in the sincere interest they bring to their listening to each other. Each type usually brings a noteworthy sense of humor and love of the bizarre and the outlandish that can give their relationship a quirky and unique character all of its own. This is often because they both share an \"outsider\" status. Fives draw Fours out by showing them other worlds and other perspectives, with a depth that Fours like. Fours help Fives stay in contact with their personal self and feelings. They have a mutual tolerance for whatever the other comes up with and neither is easily shocked. They generally find each other stimulating and are tolerant of each other's idiosyncrasies. Both inspire creativity in the other and give permission to the other to be themselves and follow their own inspirations.",
            "troubleSpots": "Potential Trouble Spots or Issues The greatest area for discord in a Four/Five pairing is that Fours are emotional types and tend to push for more contact and intimacy, sometimes becoming overly demanding, whereas Fives are thinking types and tend to push for more detachment and space in the relationship, sometimes becoming more reclusive and private. Fours can experience Fives as being too intellectual and feel that Fives are analyzing them rather than sympathizing with their emotional needs and states. They can also feel that Fives are unavailable and detached, uncaring and unresponsive to their needs in their relationship. Fours feel they can also be impractical and take too long to respond when a situation calls for action."
        },
        {
            "compatibilityMatrix": [
                4,
                6
            ],
            "goodSpots": "Both Enneagram Fours and Sixes, have many natural affinities for each other, especially since both are highly emotional and often feel insecure around people. Both tend to strong, immediate feelings and to act on their unconscious hunches or intuitions. Sixes often misidentify themselves initially as Fours because of the traits that they actually have in common. These very traits can also be ones that they bring to the relationship, enabling them to have an unusual degree of empathy and tolerance for each other. In short, Fours and Sixes can bring to each other the feeling that they are kindred souls, connected by their feelings of abandonment and a certain distrust of others. They may feel like \"orphans in the storm\" who offer mutual support and reassurance. Rather than energize each other, when they are healthy, Fours and Sixes tend to support and stabilize each other, usually acting as a sounding board for worries and complaints that they feel they cannot air anywhere else. Fours bring sensitivity, sensuality, and the ability to express emotions openly, including the feelings that Sixes themselves do not know how to express. Fours talk about their inner lives—again, something that Sixes often need to learn. Sixes bring hard work, perseverance, practicality, loyalty, and concern with security to the relationship. They are also often warm and unpredictably playful and able to break through whatever gloom and self-absorption Fours may periodically fall into. Fours give Sixes the sense that they are needed—helping to give Sixes more confidence in their ability to cope with things. Sixes like being practical and they often provide Fours with a platform of some kind to develop their creativity as well as the time and support they may need to work through their emotional issues. This combination creates steadiness and daring, balance and the ability to fill in the gaps for each other both in their own development and in practical affairs.",
            "troubleSpots": "Potential Trouble Spots or Issues As noted above, both Fours and Sixes have issues with feelings of abandonment. Both types in the lower Levels tend to be emotionally reactive, critical of others, pessimistic, and can feel overwhelmed. While they may not often talk about it, they may test each other in various ways in an attempt to discover how loyal the other will be to them. Both types may also begin to subtly withdraw attention and affection from the other as a way of defending against the hurt of potential abandonment, should it occur. But in this, both types have a tendency to create a self-fulfilling prophesy in which their fears and reactions bring about the very thing they are consciously trying to avoid. Both types can become codependent, and their reliance on each other may not result in development for either: Fours do not automatically become more practical, and Sixes do not become more insightful about themselves."
        },
        {
            "compatibilityMatrix": [
                4,
                7
            ],
            "goodSpots": "Enneagram Fours and Sevens tend to be intrigued by each other since they are a generally a case of opposites attracting. Fours tend to be quiet, introverted, self-doubting, emotional, and pessimistic, while Sevens tend to be outgoing, extroverted, self-confident, mental, and optimistic. Sevens help Fours overcome shyness and a possible reluctance to try new experiences. Fours help Sevens stay focused on what they really want—and to respect and allow their feelings. Fours and Sevens bring to their relationship the charge and mystery of their differences—that they think so differently, react so differently, and find pleasure in such different ways. They can therefore become intrigued by the other, finding him or her endlessly fascinating, always ready with something new and unexpected. Both Fours and Sevens bring a capacity for joy and ecstasy, spontaneity, emotion, and for passion. Both Fours and Sevens love lively conversation and they can pass hours sharing with each other detailed accounts of the events of the day as well as their thoughts and reactions. Both Fours and Sevens love the finer things of life, travel, good food, wine, clothes, and furnishings, and, for better or worse, both can tend to overspend their incomes on what they consider life's necessities—caviar, champagne, and another trip to Europe. They both have a love of the new and a sense of adventure and romance that can keep their relationship fresh and lively for themselves and be a source of joy and inspiration for others. Both types can be funny, irreverent, and entertaining. There is also an earthiness and bawdiness to both, as well as, paradoxically, a sophistication and elitism. Being opposites, Fours and Sevens can balance each other: Fours bringing a sense of depth and interiority, while Sevens contribute a sense of fun and emotional resilience.",
            "troubleSpots": "Potential Trouble Spots or Issues Because they are so different in many ways, Fours and Sevens must have several strong points of attraction or else they will likely miss connecting with each other. Unless some strong passion (romantic, mental, or spiritual) keeps them together, they are likely to fly apart if there are any deep disagreements or conflicts early in the relationship. Both types tend to be impulsive and to be easily frustrated with others when they are disappointed or if their life circumstances do not go as they expect. Both have high expectations for the kind of attention and quality of interactions they want from others, and if they are not forthcoming, both tend to not give others too many second chances to prove themselves. While Fours may admire and even secretly envy the Seven's resilience and high energy, they may also find themselves worn down by their fast-paced lives and what feels to Fours like the Seven's relentless plans and activities. Fours can see Sevens as too noisy, superficial, and insensitive-and occasionally coarse and insulting without realizing it."
        },
        {
            "compatibilityMatrix": [
                4,
                8
            ],
            "goodSpots": "This can be one of the most creative relationship couplings, although it is also one of the most inherently volatile. Both Enneagram Fours and Eights are intense and have strong emotional responses; both seek to get a reaction from the other, and both can be dominating of their environments—Eights are socially dominant, Fours are emotionally dominant. Both types bring passion, intensity, energy, and deep (often unconscious) feelings to all aspects of the relationship. They are attracted to each other's storminess, the other's vulnerability, and the other's \"hidden\" qualities: neither is what they seem to be on the surface. Both types are also highly intuitive—Fours by being self-aware and knowledgeable about how they are feeling, and Eights with their intuition about external phenomena, often with an extremely accurate insight about the potentials and possibilities exhibited by others. Because of their passionate natures, both types can become impulsive and reckless, taking extreme risks for love of thrills or for the sensation of being alive—and this can be tremendously exciting to the other. But there are trade-offs: Fours tend to depend on the Eight's practicality and ability to protect and provide for them, whereas Eights tend to depend on the Four's sensitivity and mysterious sense of challenge—the Four's emotional life and heart may be one world that the Eight cannot easily conquer. On the other hand, Fours see strength, charisma, and solidity in Eights. Both feel that the other can meet their intensity—that the other will not be boring or non-responsive to them. They make each other feel more alive—something that both want. Intensity, vitality, passion, and immediacy are the emotional hallmarks of this couple, and they relate to each other (and to others in their world) from an unusually high emotional pitch—there is always something happening in their relationship, and they like it this way.",
            "troubleSpots": "Potential Trouble Spots or Issues Both types take a certain pride in having a large than life quality about them: Eights in their larger than life willpower and quest for control, Fours in their larger than life emotions and in their quest for self-expression. Both types want to be free and to be free from having anyone control them, particularly in their careers and private lives. If they feel that the other is trying to control them, both types can become enraged, easily triggering gargantuan battle, financial and sexual intrigues, and rampant feelings of hatred. Both Fours and Eights are emotionally stormy and prone to periods of rage, depression, vengeance, and various forms of acting out. When conflicts between them reach a certain pitch, arguing replaces real connection, and fighting (and possible physical violence) becomes an increasingly common element of their communication, with the violence often running both ways."
        },
        {
            "compatibilityMatrix": [
                4,
                9
            ],
            "goodSpots": "This can be, paradoxically, both a very comfortable—and yet exciting—relationship pair. Enneagram Fours and Nines are both withdrawn and private, sensitive to the feelings and needs of the other, and empathetic to the suffering of others. Both can be tender-hearted and highly sympathetic to the suffering that they find in the world and in each other. Both want to find a deep connection with the other, and yet, both also want a certain degree of autonomy and insist on a very real degree of privacy. Both Fours and Nines can be highly creative, and as a pair they enthusiastically support the other's creativity and give the other a good deal of space in which to develop their talents. Both are idealistic and want to connect deeply with someone, feeling that they are on a search for their soul mate, the one person in the world with whom they can completely connect and be themselves. Both Fours and Nines also bring a sensuality and love of comfort that is noteworthy; this may express itself in their lifestyle, traveling habits, and in their sexual and other intimate activities. This is a couple that likes to stay in bed all Sunday morning, reading the papers and talking. Each brings passion and an appreciation of the other coupled with a desire to be comfortable and build a life with the other. Fours can make Nines become more intense and expressive about how they feel, while Nines can allow Fours to feel understood and accepted for who they are. Fours are good at naming feelings and pinpointing emotional states; Nines are good at creating an atmosphere of nonjudgmental acceptance, Nines may even enjoy the emotional storms and dramas that Fours occasionally get into, feeling that it adds spice to their life together. A lot of the pleasure and passion of this couple is nonverbal in the depth of the understanding that each has for the other.",
            "troubleSpots": "Potential Trouble Spots or Issues The biggest area of conflict between Fours and Nines is that each tends to react differently as stress increases: Fours become more emotionally volatile and demanding, while Nines become more disengaged and impossible to get through to. Fours can feel too unstable and dramatic, unpredictable and moody for Nines, while Nines can feel too unresponsive and emotionally inert, unsatisfying and uncommunicative for Fours. Nines can become angered by the Four's sense of entitlement and demands for attention and exemption. Fours can become angered by Nines' irresponsibility and apparent inability to learn from their mistakes and experiences. If conflicts and tensions increase between them, Nines can shut down more and more so that communication stops, and they give Fours the subtle message that they don't want to hear their reactions or deal with their feelings. Fours can feel that talking with Nines is like playing tennis with yourself—there's no one to hit the ball back—and there is too little relating in the relationship. Contempt for what Fours see is being boring and ineffectual can end the relationship."
        },
        {
            "compatibilityMatrix": [
                5,
                5
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Fives generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. To a Five, another Five is virtually his or her idea of the perfect companion: well informed, intellectually stimulating, independent, imaginative, quiet (unless it's about subjects of mutual interest), fact oriented (as opposed to being utterly emotional and subjective), non-intrusive, and always ready for a good debate or a good movie. Since they do not wish to be controlled in any way, or even for people to know too much about them, Fives give a great deal of personal and emotional space to each other. It may be weeks or even months before they both see the insides of each other's homes. They value tactfulness and would never knowingly put people on the spot for personal information or make personal demands on anyone for favors. Distance, respect, courtesy, good boundaries, few demands (and no expectations), are hallmarks of a double Five pairing. Of course, Fives can be curious about each other and their private lives, but there is a great deal of reticence to take the initiative where personal matters are at stake. Some Fives are more forward socially but their experience is somewhat like the mating of shy and prickly animals: unless the other finds a way to hold on to the Five, the Five is soon off again. Two Fives, as a pair, they must learn quickly how to balance the independence they require with the degree of intimacy and personal sharing and self-disclosure required to establish a meaningful relationship. In most cases, this takes a while, although once Fives have found someone with whom they feel comfortable, they can become quickly (but still secretly) attached. Long silences and breaks are punctuated by intense bursts of communication. The meeting of minds does not have to be full of words.",
            "troubleSpots": "Potential Trouble Spots or Issues Double Five pairing can suffer from over-intellectualizing their relationship, approaching each other analytically rather than as someone to be felt or identified with in a more emotional and subjective way. They also tend to compartmentalize their life together (just as they do their own lives), drawing boundaries around your world and my world. Both parties can begin to become secretive and to lead something of a double life, consciously withholding information about themselves and their activities from the other out of the fear of being engulfed by them, and from a deep-seated resistance to sharing themselves or merging with someone. Double Five pairs can also become argumentative and competitive, getting into a pattern of intellectual bickering over fine points and (ultimately trivial) details. But since intellectual prowess is so highly prized in Fives, there may be one or more areas in which competitiveness and intellectual showing off at the expense of the other begins to take place."
        },
        {
            "compatibilityMatrix": [
                5,
                6
            ],
            "goodSpots": "Both Enneagram Fives and Sixes are mental types, although there are significant differences. Both have respect for the intellectual acumen of the other and the expertise and technical mastery the other possesses. They may well begin a relationship as colleagues or by sharing the same professional area of interest which forms the basis for a friendship and eventually something more intimate. Both types respect detail, factual objectivity and accuracy, craftsmanship, and the ability to analyze situations without inserting personal opinions or biases. As a pair, Fives and Sixes can be highly effective in dealing with crises because both are attuned to danger and to bringing their expertise to solve problems. Fives also offer emotional calm, detached objectivity, observational skills, an unusual and penetrating curiosity, and an unwillingness to settle for easy answers. Sixes bring strongly held values and ideas that make them less objective than Fives although they are more passionate. Their very emotional reactivity—including anxiety and fear-gives Sixes a more sympathetic, human quality. Sixes are more openly unsure of themselves and often look to authorities of some kind (including the Fives they trust) to give them guidance and advice. Fives tend to be surer of their ability to think for themselves and to entertain new ideas. Fives also tend to be more skeptical and rejecting of authority. Fives are accepting of Sixes' changing needs for independence with connection; they are also patient with the Six's vacillations. The devotion of Sixes and understated caring can break through the Five's tendency to isolate. Thus, Fives and Sixes, as a pair, tend to have a symbiotic intellectual relationship of doubt and decision, questions and answers, problems solved and problems discovered that can be endlessly stimulating. In any event, for a relationship between these two opposite head types to work, there must be a tested and unshakable trust between them: they may often come to different conclusions, but they at least know that their hearts and minds are in the right place.",
            "troubleSpots": "Potential Trouble Spots or Issues The potential trouble spots between Fives and Sixes have already been hinted at above. In short, Fives and Sixes tend to think in diametrically opposite ways and often are on the opposite side of the fence in their conclusions. There will be a good deal of intellectual and emotional tension between them, for better or worse. Sixes tend to look to precedents for guidance about how to proceed; they tend also to be more guided by rules and procedures and protocols, building their arguments and marshalling their facts meticulously, if sometimes ponderously, so that they can feel unassailable. Fives tend to take greater intellectual leaps of the imagination and to consider less or not at all what has been the received wisdom or common consensus of opinion."
        },
        {
            "compatibilityMatrix": [
                5,
                7
            ],
            "goodSpots": "Since they are both thinking types, Enneagram Fives and Sevens both bring a lot of mental energy and appreciation for ideas to their relationship. Their approach is complementary and reciprocal—each one brings something that the other does not have. On the positive side, Fives bring depth, clarity of observation, insight into the objective state of affairs, independence and self-reliance, and often a wonderfully, off-beat, whimsical sense of humor. It almost goes without saying that they have quick minds and love knowledge and intellectual pursuits. Sevens bring quickness not only of mind but of spirit—ready to do almost anything at a moment's notice, from going to a movie to booking an around the world trip, from moving the furniture across the room to moving the home to another state. Sevens are independent, although they like to have a few people around to join in the fun and to add to the celebratory, happy feeling that they are always looking for in their lives. They tend to be generous and extravagant, optimistic, gregarious, and outgoing with strangers, often the life of the party. Fives tend to be somewhat more frugal with money and resources, seldom spending much on themselves (unlike Sevens). Fives also tend to be private and taciturn around strangers, although they can be very funny once they get to know you and feel secure. Fives ground and deepen Sevens, giving them permission to take themselves and their interests more seriously, to focus their energies, and to stay with things until they pay off. Sevens get Fives to try new experiences and to make more social contacts. They may also run interference for Fives in social settings. Both like conversation and ideas and they love to explore new realms together. In short, this is a mixture of opposites with different attitudes about how to enjoy themselves and how to be fulfilled in the world. Fives say: \"Life is short: don't expect too much.\" Sevens say: \"Life is short: try it all.\" Both attitudes are true and can usefully balance the other.",
            "troubleSpots": "Potential Trouble Spots or Issues Fives tend to minimize their needs and their expectations of life, particularly whenever they are under more stress. They tend to see things in terms of scarcity and of being personally unprepared to meet the demands of the world. The result is that as pressures on them increase, Fives tend to withdraw and detach emotionally from everyone around them, and ultimately, even from themselves. They become more reclusive, isolated, disembodied minds who are difficult to break through to, much less to engage in constructive action. This pattern is very difficult on Sevens for whom quick action and having multiple escape routes is the norm. As pressures increase on them, Sevens go into hyper-drive, going more places, doing more things, talking more, getting more advice, gossiping about their relationship problems, and possibly turning to substance abuse to control their mounting anxiety and sadness. These problems only make Fives withdraw further and become frightened of someone who they see as out of control."
        },
        {
            "compatibilityMatrix": [
                5,
                8
            ],
            "goodSpots": "These two types bring to each other complementary and reciprocal talents — just what the other needs but is not necessarily aware of. For instance, Enneagram Fives need to be more identified with their body and with their instinctive energy; they need to be more engaged with the practical world and to feel their own sense of power and capacity. They can learn these qualities from Eights. On the other hand, Eights need to be more thoughtful and aware of the impact of their actions on themselves and on their environment. They need to know more and to think of consequences more carefully before acting. Every action produces a reaction, and it is not necessarily the one that the Eight wants to happen. This kind of analytic foresight is something Eights can learn from Fives. Besides these qualities, both Fives and Eights bring a common insistence on independence and non-interference from others. Both types are aware of boundaries and dislike intrusion. Both enjoy a good debate, and both admire someone who stands up for himself intellectually and/or physically. Both types feel like misfits and so they understand each other's emotional core, often in an unspoken way. Both types need personal space, but when they find each other, they can both show a surprising degree of need and vulnerability. They see the other person behind the defense, relating to each others' sense of dignity and hidden vulnerabilities. Both can be stoical toward their own suffering and unhappiness, with little or no self-pity. As a couple, they can bring power and depth, action and thoughtfulness, brilliance and brashness to their world. They are also the natural protectors and advisors of each other: Eights love to protect less tough Fives, and Fives help Eights recognize the subtleties for their plans and actions. These two types can therefore band together as a coalition of power and brains, a formidable combination.",
            "troubleSpots": "Potential Trouble Spots or Issues Fives are not much in touch with their physical bodies—they identify with their minds and are indifferent to virtually all of the physical and practical goals that more earthy Eights have. Not wanting a house, a company, or a spouse are all sources of pride to average Fives who feel good about themselves when they can cut off from their needs and learn to do without. Eights, by contrast, take pride in their earthly conquests, whether socially, financially, sexually, or psychologically. Making their mark on their environment is a primary goal for Eights and they often use their physical stature and energy to intimidate people and enforce their will. Thus, the more insecure these two types become, the more they react in completely opposite ways: Fives shut down more completely, become more taciturn, secretive, and isolated, while Eights become more confrontational, threatening, and enraged."
        },
        {
            "compatibilityMatrix": [
                5,
                9
            ],
            "goodSpots": "An Enneagram Five/Nine pair gives each other a great deal of personal and emotional space for activities and for doing things on their own. Neither one would hovers or intrudes on the other, although the capacity for a healthy emotional connection and interest in each other is still present. This pair is characterized by a sense of quiet, non-intrusiveness, spaciousness, and respect for each other's boundaries, work, and individuality. Nines are undemanding and uncritical. Nines are the more emotional of the two types, but even so, Nines do not always know what they are feeling or how to express themselves adequately. They appreciate the Five's ability to be curious about them and to draw them out of the kind of \"inner fuzziness\" that Nines can get into. Nines appreciate the Five's intellectual sharpness, ability to ask the right questions, to remember things, to be objective, and their patience. Fives appreciate Nine's warmth—and when there is a real personal or sexual connection between them—their nurturing qualities. Fives usually feel dry and cut off from emotional sustenance; if they find this in someone, it is likely to be a Nine who can offer unquestioned acceptance, sensual comfort, and tenderness. Nines often make Fives relax-deeply and completely, something Fives very much need. Both types have an intellectual component and if they are more or less on an intellectual par with each other, they can be a powerful and stimulating couple: the pungent wit of the Five is softened by the droll understatement of the Nine. Both appreciate the irrational and the absurd, although Fives dig far deeper into the dark areas of life than Nines. This pair can be a case of two people initiating the other into very different world views: the idealism and the realism, the sunlight and the darkness both have a place here.",
            "troubleSpots": "Potential Trouble Spots or Issues Tensions between Fives and Nines can begin to grow as a result of the very amount of space that each is willing and able to give the other. Both are highly aware of boundaries and of feeling pressured or intruded on by anyone, and so both tend to expect an unusual degree of independence from the other and to give a large degree of freedom to the other without being asked. For this reason, it is often difficult for Fives and Nines to take the initiative (to make a date, for instance) or to be decisive about calling on a regular basis, or even to know what their feelings are telling them about the other. There may well be a great deal of comfort and intellectual rapport, but one or both of the couple may be relatively cut off from their feelings so that they do not actually know how much they care for the other, or even if they are in love. Nines tend to be more emotionally available and fluid in this regard, liking and even idealizing the Five while they are together, but quickly forgetting those positive feelings when the person is away. Nines easily get into an out of sight, out of mind state where the other might as well not exist if they are not physically together. Nines can also idealize the other so much that when they get together, the Five cannot really live up to the image that the Nine has of them in their imagination. Fives, on the other hand, can become frustrated by the on again, off again attentions of the Nine and begin to become cynical and pessimistic about the relationship, analyzing the Nine and intellectually dissecting the relationship both as a defense from being hurt and as a way to express anger over their disappointment."
        },
        {
            "compatibilityMatrix": [
                6,
                6
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Sixes generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. Strong Six couples understand each other deeply and make a point of trying to understand what they don't understand. Two Sixes usually bond with each other very quickly sensing a kindred spirit, and there can rapidly develop a playful, bantering, buddies-in-arms kind of excited collusion and relief, like two kids who have found each other in the woods and can help each other to safety. A double Six couple will have a sense of shared secrets and values, of intellectual stimulation and questioning that they find both useful and stimulating. Trust is extremely important to both Sixes, and once it has been established, it allows them to relax and enjoy themselves as they do with few others. Trust allows double Six couples to think aloud to test ideas, voice doubts and suspicions, and to discover what they really feel about various things. They give each other a lot of support and mutual protection, and are ready to come to the other's aid without hesitation. Loyalty, commitment, and a \"You're my friend—no questions asked\" attitude reinforces the feelings of security and safety that they build together. There can also be a great deal of unspoken sensitivity and delicacy in a double Six relationship. Sixes are generally not adept at talking about their feelings directly, so their feelings and attitudes are mostly expressed in their actions and in the depth of their dedication and steadfastness. Each person also inspires the other as each works for the other's welfare and happiness—often more energetically than they would for their own alone.",
            "troubleSpots": "Potential Trouble Spots or Issues Double Six couples (whether in intimate or professional situations) tend to be emotionally reactive, and once a spirit of negativity or scarcity enters the picture, their fears can begin to feed off of each other. Double Six pairs can get into worst case scenarios and other forms of catastrophizing, each magnifying problems until they both feel like crises are everywhere and that they are doomed. Sometimes extreme reactions will cause them to act impulsively, without thinking through their situation or finding an adequate solution to their problem. They may arbitrarily take an action—any action—that promises to relieve their anxiety. On the other hand, double Six couples can become indecisive and fall into a feeling of stalemate and confusion, unable to act and unable to get some perspective on their problems. Since they are also emotionally reactive, they tend to become edgy and argumentative with each other, often blaming the other for the situation and for not providing the solution. Shifting blame back and forth can be like a ping pong match whose main objectives are to keep connection with the other by keeping them in the argument—and to buy time to work through their anxiety so that a solution may appear."
        },
        {
            "compatibilityMatrix": [
                6,
                7
            ],
            "goodSpots": "Both Enneagram Sixes and Sevens are mental types, and there can be a great deal of mental stimulation in this pairing. These two types offer many areas in which they reinforce each other, and some areas in which the strengths of one counterbalance the limitations of the other. Sevens are usually entertaining and tend to lift the spirits of Sixes. Both are quick mentally and often have rapier wits: they enjoy bantering with each other, verbally sparring and seeing how absurd or funny they can become as they push each other to more outrageous limits. Sevens are particularly good at generating new ideas while Sixes are particularly good at mastering the practical steps that are necessary to get things done. Sevens help Sixes put fear and limitation into perspective, and sometimes to move beyond them entirely. They thus make effective team members in which the Seven lays out the big picture and gets people excited about new possibilities while the Six moves in with the logistical and tactical know-how, following through with the details. In intimate relationships, the same balance pertains: Sevens are the stimulators, Sixes are the regulators—and they can keep each moving forward by allowing the other to counterbalance their own limitations. To this visionary-functionary mix, Sixes bring commitment and loyalty to the Seven, often an expertise and groundedness that the Seven comes to trust and rely on implicitly, as well as a strong grip on reality and what can be accomplished within given parameters. Sevens bring a driving sense of optimism and possibility, high energy, a sense of adventure, and fearlessness with regard to failure. They can teach Sixes how to be resilient and how not to fear the future, while Sixes can teach Sevens the difference between optimism and pipedreams.",
            "troubleSpots": "Potential Trouble Spots or Issues Despite how well Sixes and Sevens can reinforce each other's strengths when they are healthy, in the average to lower Levels, the picture can shift quickly. Sixes are essentially interested in security and predictability, foreseeing problems and building procedures to prevent future uncertainty. They are aware of limitations and why things cannot be done—or at least done easily. Sevens, by contrast, are about seeking happiness and relief from increasing frustration or anxiety. They are about trying new things, seeing new possibilities and overcoming limitations. They do not want to hear about problems or obstacles: they want things to be done the day before yesterday. Sixes tend to be negative and pessimistic, while Sevens tend to be positive and optimistic."
        },
        {
            "compatibilityMatrix": [
                6,
                8
            ],
            "goodSpots": "Enneagram Sixes and Eights can build an extraordinarily strong, long-lasting relationship on what is, at root, a defensive view of the world. Both types feel that most people and the world are selfish and untrustworthy, and that the world is highly unpredictable. One therefore needs to take care of oneself and one's own interests (Eights) and have strong allies and the ability to get back up from one's friends (Sixes). Both Sixes and Eights have deep issues with trust—and with finding people they are able to trust-and so when they have found each other and have gone through a period of testing, their alliance can be solid and deep. Once they have bonded with each other, both types have done so on a deep level of their being, and while the relationship may change over time, they are never indifferent to each other. They both admire and try to embody strength, commitment to one's word, honor, unquestioned loyalty, responsibility, hard work, courage, a spirit of protectiveness, and fighting for the underdog. Both are doers, and enjoy being active, getting tasks accomplished, building a more safe and secure world for themselves and their loved ones. Sixes bring warmth, the desire for personal connection and commitment, a certain playfulness and sensitivity. They are also mental types and bring skepticism, analytic thinking, and the ability to think through decisions and to foresee outcomes and potential problems before acting. Sixes thus tend to act as advisors and lieutenants to Eights who tend to take the lead and provide the vision and audacity that Sixes sometimes lack themselves. Eights also bring directness and decisiveness, strong wills, confidence, a can do spirit that is energized by adversity and a penchant for taking on challenges. Sixes tend to look up to the Eights as their hero, while Eights are touched by the Six's devotion and courage. Eights are aware of their inner struggles and what it takes to overcome them. When there is genuine affection between these two types, there may be fireworks and occasional fights, but the bond only seems to grow stronger with time.",
            "troubleSpots": "Potential Trouble Spots or Issues Both Sixes and Eights are emotional, although both tend to hide their emotions and vulnerabilities as best they can. Eights do so under a veneer of toughness and bravado, Sixes under a shell of defensiveness and bluster. Both tend to counterattack and go on the offensive when threatened—or when they feel they are being threatened. In general, Eights tend to take the lead in most relationships they are in and to set the tone and make decisions. They expect others to obey them and to be loyal to them. Eights may tolerate (or even be amused by) an occasional flare up of independence on the part of others around them, but ultimately, they expect to be in charge. For the most part, this is also fine with Sixes, except for those times when Sixes feel the need to push back and to prove themselves. They need to show others (including the Eight) that they cannot be pushed around or taken advantage of. Power struggles of all kinds can ensue. This is especially true of \"counterphobic\" Sixes who can actually react much like Eights, displaying leadership, decisiveness and independence (on the positive side) as well as bluster, aggression, and defiance. Sixes who are more counterphobic tend to get into more open fights with Eights until both have determined their territory and just how far each can push the other."
        },
        {
            "compatibilityMatrix": [
                6,
                9
            ],
            "goodSpots": "This is one of the most stable and most common relationships. Although both types are very different, they want rather similar things—security and predictability (Sixes) and stability and autonomy (Nines). They both want their lives to be built on solid, dependable values and for good, honest work to be rewarded. Both types tend to personify \"middle of the road\" values in their time and culture, to be dutiful, respectful of authority, and to abide by the rule of law. On the other hand, there is a rebellious streak in Sixes and a counterculture streak in Nines that allows some of these couples to live on the fringes of society, to be unusual in their lifestyle and beliefs, to be free thinkers and unconcerned about conventional values and mores. More for Sixes and Nines than for most couples, much depends on their belief systems and the quality of their childhood experiences—and they are looking for a partner who will mirror this, including their own beliefs and reactions. To this mix, there are also complementary differences: Sixes bring a more active mind, questioning and alert to exceptions, to problems, and to safety issues. They can be more skeptical of others and find it more difficult to be trusting: others need to prove themselves first. Nines, on the other hand, are usually trusting and unquestioning, sunny and easy to get along with. They are optimistic and steady, offering support and non-threatening acceptance. If Sixes tend to see the exception and to focus on complications, Nines tend to see the general and to focus on what will work without problems. This couple gets along well, greasing each other's wheels and adding just enough gas to the mix to keep them moving forward together. Change, when it comes, is slow and methodical. Both tend to see themselves as simple, regular people and do not feel special or exempt in any way. Both bolster the other's confidence through their solidarity with each other. They are generous with each other and do not crowd the other or make special demands. When they find a relationship such as this, it usually feels like they have found what their heart has been seeking and their dream has come true.",
            "troubleSpots": "Potential Trouble Spots or Issues Since Sixes and Nines find it very difficult to say what is actually on their minds (and what they really want for themselves), there is a great tendency in this relationship to clam up, to be silently stubborn and defensive, and to make the other person guess what is going on. If there is little motive to do so, the two parties will fall into a stalemate that keeps the other at arm's distance, yet close enough so that the other will not drift away. They may also begin to have health problems or other nonspecific complaints about themselves that seeks to bind the couple in cords of concern and guilt. Psychological or physical problems help to ensure that the other person will continue to be there."
        },
        {
            "compatibilityMatrix": [
                7,
                7
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Sevens generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. The key characteristics of double Seven relationships are easy to spot: high energy, spontaneity, frequent travel and entertaining, and an interest in anything new or that promises to open new possibilities. If both Sevens are psychologically healthy and well balanced, there is a noteworthy joyousness and sense of abundance that permeates their relationship and which spills out to everyone around them. A healthy double Seven relationship is emphatically happy—even radiant and exuberant-and both parties enjoy sharing their happiness with as many others as possible. They are thoughtful, sensitive, idealistic, hospitable, and generous. Double Seven couples are sociable and unusually good company for others as much as they are with each other. Each brings to the relationship a spirit of personal freedom that is noteworthy. Neither wants to be tied down in routines or empty, formal commitments, and so both Sevens are determined to not impose many rules or expectations on the other. They want their relationship to be guided by the fact that both parties positively want to be with the other rather than feeling that they are locked into some constricting set of obligations. Both Sevens bring a sense of possibility, open-endedness, experimentalism, and realism that enables them to build a life together—while making it an enjoyable experience for themselves and their circle of family and friends. Double Seven pairings are optimistic and resilient, and always ready to pick themselves up and start over again when they run into difficulties. Gratitude for the relationship—and for finding each other—is the guiding spirit.",
            "troubleSpots": "Potential Trouble Spots or Issues Building a relationship usually takes time spent together, and patience to weather the disappointments and disillusionments that are also usually part of the picture. One of the main problems with double Seven relationships is that of impatience—of wanting the relationship to be more complete and developed than it really is. While double Seven pairings have no lack of energy and high expectations for their relationship, they may find it difficult to stay with both themselves and the other as both work through the growing pains of the relationship. As time goes on and the relationship is no longer the stimulating experience that it once was, Sevens begin to turn their attention elsewhere, possibly to their work or to other involvements."
        },
        {
            "compatibilityMatrix": [
                7,
                8
            ],
            "goodSpots": "Both Enneagram Sevens and Eights are highly self-assertive, independent, and strong willed. Both types also resist being controlled or limited by authorities or even by internal, psychological mechanisms. Once someone (or even some inner voice) says do not, both Sevens and Eights respond with defiance and a desire to push the limits, whatever they may be. Both types are practical, this world-oriented, not necessarily worldly or materialistic, but concerned with concrete affairs and finding happiness and fulfillment in the here and now. Neither likes to postpone their satisfactions or to settle for vague promises about the future. Both tend to overspend their budget on a bountiful lifestyle that is a source of pleasure for themselves and their friends and family. They love to entertain and offer the best there is to others as a sign of their generosity and as a signal of their success and standing in the world. Both are high energy people, often gifted with a vitality and gusto for life that is noteworthy. A Seven/Eight couple can get a tremendous amount done, and are revitalized by staying active. They are adventuresome and are willing to try new things in their relationship. They are also both extremely outspoken and do not hold themselves back from voicing their own opinions or making their needs known. Sevens bring more lightness and a sense of fun and excitement, trying something new and different for the sake of keeping things fresh and stimulating. They are also usually the more talkative of the two: Sevens are usually highly engaging storytellers and raconteurs, turning their adventures (and catastrophes) into entertaining tales. Eights are usually surprisingly more reserved and moody than is often recognized, and they rely on the Seven to lighten the atmosphere and to make their practical affairs more fun and enjoyable. Eights also bring directness, decisiveness, and the willingness to face difficult situations with determination and persistence.",
            "troubleSpots": "Potential Trouble Spots or Issues While a Seven/Eight couple can be an extremely productive, high-energy pair, problems may begin if the constructive outlets for that energy are thwarted or misguided. Sevens and Eights both need to find positive outlets for their prodigious energies and interests, and if they do not, they will inevitably discover destructive ways of releasing them. They may also begin to turn against each other or bring each other down in a kind of dark collusion that can have tragic consequences for them both. Both Sevens and Eights are extremely strong willed and independent and so both resist being controlled by the other, often taunting the other with their lack of influence over them. Eights tend to be authoritarian and bullying, ordering the Seven around and making threats if they are disobeyed. Sevens will attempt to avoid being controlled, and can become highly insulting and contemptuous of the Eight and their heavy-handed tactics. Both types will flaunt the other's inability to have their way, as if their defiance were a badge of honor. Both types can be extremely selfish and self-centered, feeling that the world revolves around them and their desires. Of course, this builds in the likelihood of conflicts."
        },
        {
            "compatibilityMatrix": [
                7,
                9
            ],
            "goodSpots": "Enneagram Sevens and Nines are one of the most often seen pairings of the types because they bring a good mix of similar and opposite qualities. Fundamentally, Sevens and Nines are both positive outlook types who are optimistic, upbeat, and who prefer to avoid conflicts and negatives in their lives and in their relationship. Both types are friendly, sociable, and generally happy with themselves and with their lives. Neither is typically introspective or brooding, preferring to get on with things rather than to look backward or to stew over failures or disappointments. Both are able to forgive and forget and to make the best of their limitations, whatever they might be. They might be separated physically or have few financial means, but Sevens and Nines can make the best of these circumstances and continue to build their future together. Both tend to be practical, although both can have a romantic streak and a physicality that adds spice to their relationship. Both are also often funny and can make even the most mundane events pleasurable and pleasant. Sevens provide the stimulation, Nines the audience. On the complementary opposite side, Sevens are more active and self-assertive than Nines; they tend to take initiatives, to make plans, to have multiple interests, and to provide the energy for the couple. Sevens are mentally quick, self-confident, curious, open to new experiences, and resilient when there are setbacks. They bring the fun, sparkle, and sense of adventure. Nines bring a sense of steadiness, support, and acceptance to the relationship. They tend to be more sympathetic and soft hearted than Sevens, as well as more relaxed and undemanding of themselves and their environment, including other people. Nines are also often generous and willing to make personal sacrifices to help others and to make them happy. Their personal simplicity and uncomplicatedness meshes well with the more assertive qualities of the Seven. As long as neither takes advantage of the other, there is a good balance between energy and relaxation in this couple.",
            "troubleSpots": "Potential Trouble Spots or Issues One of the main areas for potential problems is the fact that neither Sevens nor Nines are usually adept at working through negative or painful aspects of their lives or of the relationship. Both would prefer everything be kept on the positive side; neither one wants to fall into the possibility of depression or to otherwise cut off their chance for happiness. At most, they will briefly acknowledge a problem or conflict in their relationship by blaming the other: both types tend to become anxious, critical, and edgy when under stress, taking these things out on someone else rather than working through negative feelings themselves. Both types also tend to be blind to their own share of responsibility for how the relationship has deteriorated, including their own contribution to communication problems. Nines tend to collapse in the face of the Seven's angry demands, withdrawing into silence and, eventually, inaction. They become increasingly unable to make sense of the Seven's grievances, and so they become stubborn and shut down further, with occasional outbursts of anger or anxiety, or both."
        },
        {
            "compatibilityMatrix": [
                8,
                8
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Eights generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. Both Eights will bring a lot of energy, vitality, and passion to the relationship: few other combinations are so intensely involved with each other as this nor are they able to create such fireworks. They both have strong willpower, independent thinking, the ability to make decisions and get things done, and a desire to see results in the practical world: they will not simply talk about building a house or going on vacation—they will make it happen. When two Eights are well matched, they paradoxically both stimulate each other and relax each other at the same time. They feel that their energy has been met, so they can relax around the other Eight and turn their attention and energy toward other interests. Two Eights are also able to profoundly relax each other because they have confidence in each other. They know that they have what it takes as a team to do what needs to be done, to be safe, secure, and stable in their own world. The feeling is \"We've got it covered.\" Rather than be marked by high energy, quiet confidence is a hallmark of a double Eight couple. This is because they are relieved (and quietly happy) to have found someone else strong who they can depend on. This also leads to a profound feeling of mutual respect, direct and frequent communication, the ability to air their needs and feelings and to settle their occasional disagreements cleanly and quickly. Double Eight pairs can build a significant empire of some sort together, and because they feel that they have unshakable support in the other, they can also be generous and open-hearted with others.",
            "troubleSpots": "Potential Trouble Spots or Issues A double Eight combination will be extremely volatile, with lots of ego on display, frequent tests of wills and more or less open jockeying for control. They can get into competitions and rivalries because real equality and sharing is difficult between a lower functioning double Eight couple. Issues about being (and staying) in control will likely be the center of many conflicts, especially since lower functioning Eights do not want to back down or be seen as weak in any way. Both will therefore struggle to dominate, at least in some area, making for a highly reactive and conflict-ridden relationship."
        },
        {
            "compatibilityMatrix": [
                8,
                9
            ],
            "goodSpots": "Enneagram Eights bring leadership qualities—a take charge, \"we can do it\" mentality that others usually look up to and rely on. They are full of self-confidence and vitality and feel like a force of nature that cannot be denied. Nines generally admire these qualities in Eights and often gravitate to them. Nines typically tend to live vicariously through the positive qualities of the other, and Eights like to have people around who are impressed and stimulated by the Eight's leadership, vitality, and brashness. Nines genuinely admire the Eight's ability to make things happen and to fearlessly take on challenges. On the other hand, Nines bring a sense of calm and stability that Eights find soothing and necessary for their wellbeing. They also bring to Eights a feeling of quiet pride in the Eight's bravado and more assertive qualities, encouraging Eights to continue in their take charge style. Even healthy Eights spend a lot of time overcoming obstacles and adversity; they are fighters trying to survive and make their mark on the world. Nines are like a safe harbor, a respite, a person with whom Eights can let down their guard and relax. They tend therefore to teach each other what the other lacks: Eights bring Nines self-confidence and self-assertion, while Nines teach Eights which battles are worth fighting for and how not to push so hard. The Eight/Nine couple is thus like fire and water—an active force and a receptive force—that has an archetypal feeling about it. Their roles are well-defined with each playing a parenting role toward the others—one is usually the daddy while the other is the mommy—although this does not go along gender lines as might be expected. Both have powerful drives and strong willpower; both like comfort and simplicity; both want to create a safe retreat from the world. When these forces and their talents are harnessed together after the same goals, this pair can be dynamic and powerful but also comfortable and receptive at the same time.",
            "troubleSpots": "Potential Trouble Spots or Issues One of the main problem areas for people of this combination is that, as they deteriorate, their defenses go in opposite directions: Eights tend to push harder, while Nines tend to increasingly shut down. Nines can become unresponsive, or worse, energetically pushing away the Eight as a defense. Eights become more aggressive and belligerent, demanding that their energy be met. Nines respond by not responding: they go on emotional strike, and may begin to react passive-aggressively, sabotaging the Eight's activities in various ways. This causes Eights to escalate berating and threatening the Nine, or else to encourage Eights to react passive-aggressively."
        },
        {
            "compatibilityMatrix": [
                9,
                9
            ],
            "goodSpots": "As with all double-type relationships, two Enneagram Nines generally bring the same qualities to each other. Therein lies both a main source of the attraction as well as one of the main pitfalls. Thus, the Level of health of each person is especially important for these types of relationships as are their dominant instincts. One of the most common same-type pairs, double Nine couples are invariably quiet, gentle, supportive of each other and of those around them, comfortable to be around and hospitable to others. They are easy-going and do not let the minor irritations of life or of the relationship get to them easily. They tend to look positively on their life circumstances, whatever they are, making the most of whatever they have. They are patient with each other and give the other partner the benefit of the doubt, quick to forgive if there have been spats or conflicts, generous and steady in their emotions and habits. They give each other lots of space, undemanding, non-judgmental attention, and a good deal of affection. Both feel that the other is a kindred spirit who can be curious and adventuresome, although not too much so. Little deeply rocks, or even threatens, the world of a double Nine couple. They are typically people who enjoy regularity and predictability, the pleasure of the familiar and the tried and true. For example, most double Nine couples tend to go to the same restaurant or to the same vacation spot over and over again once they have found something they like. While being friendly and approachable, they are also surprisingly domestic and protective of their family and their private world. This pair wants to create and maintain a safe haven from life's ups and downs. Importantly, both feel unpressured by their relationship. The lack of pressure and stress in their ordinary interactions is one of the main attractions to this relationship. Neither one wants to feel put upon—they both want to take life at their own pace. Mellowness (with a certain feistiness and zippiness, depending on the instinctual pattern) is the hallmark.",
            "troubleSpots": "Potential Trouble Spots or Issues The very steadiness and regularity of a double Nine couple is also part of what could be their Achilles' heel: the fear of rocking the boat or of allowing anything to intrude on the peace and harmony of their world. They can seem to be friendly but get stuck in doldrums, gradually dropping social connections. The outside world, other people, even family members, can be subtly resisted or neglected in various ways if the Nine couple feels sufficiently threatened in some way. Double Nine couples can be so bound to their desire for harmony that they also find it difficult to raise important issues to the other. They might well love each other, but very little real communication begins to take place. Most of it is non-verbal or worse, exists only in their imaginations."
        }
    ]
}